fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
/* Assembler implementation for AVR32.
   Copyright 2003,2004,2005,2006,2007,2008,2009,2010 Atmel Corporation.

   Written by Haavard Skinnemoen, Atmel Norway, <hskinnemoen@atmel.com>

   This file is part of GAS, the GNU Assembler.

   GAS is free software; you can redistribute it and/or modify it
   under the terms of the GNU General Public License as published by
   the Free Software Foundation; either version 2, or (at your option)
   any later version.

   GAS is distributed in the hope that it will be useful, but WITHOUT
   ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
   or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public
   License for more details.

   You should have received a copy of the GNU General Public License
   along with GAS; see the file COPYING.  If not, write to the Free
   Software Foundation, 59 Temple Place - Suite 330, Boston, MA
   02111-1307, USA.  */

#include <stdio.h>
#include "as.h"
#include "safe-ctype.h"
#include "subsegs.h"
#include "symcat.h"
#include "opcodes/avr32-opc.h"
#include "opcodes/avr32-asm.h"
#include "elf/avr32.h"
#include "dwarf2dbg.h"

#define xDEBUG
#define xOPC_CONSISTENCY_CHECK

#ifdef DEBUG
# define pr_debug(fmt, args...) fprintf(stderr, fmt, ##args)
#else
# define pr_debug(fmt, args...)
#endif

/* 3 MSB of instruction word indicate group. Group 7 -> extended */
#define AVR32_COMPACT_P(opcode) ((opcode[0] & 0xe0) != 0xe0)

#define streq(a, b)		(strcmp(a, b) == 0)
#define skip_whitespace(str)	do { while(*(str) == ' ') ++(str); } while(0)

/* Flags given on the command line */
static int avr32_pic	= FALSE;
int linkrelax	= FALSE;
int avr32_iarcompat	= FALSE;

/* This array holds the chars that always start a comment. */
const char comment_chars[]		= "#";

/* This array holds the chars that only start a comment at the
   beginning of a line.  We must include '#' here because the compiler
   may produce #APP and #NO_APP in its output.  */
const char line_comment_chars[]		= "#";

/* These may be used instead of newline (same as ';' in C).  */
const char line_separator_chars[]	= ";";

/* Chars that can be used to separate mantissa from exponent in
   floating point numbers.  */
const char EXP_CHARS[]			= "eE";

/* Chars that mean this number is a floating point constant.  */
const char FLT_CHARS[]			= "dD";

/* Pre-defined "_GLOBAL_OFFSET_TABLE_"  */
symbolS *GOT_symbol;

static struct hash_control *avr32_mnemonic_htab;

struct avr32_ifield_data
{
  bfd_vma value;
  /* FIXME: Get rid of align_order and complain. complain is never
     used, align_order is used in one place.  Try to use the relax
     table instead.  */
  unsigned int align_order;
};

struct avr32_insn
{
  const struct avr32_syntax *syntax;
  expressionS immediate;
  int pcrel;
  int force_extended;
  unsigned int next_slot;
  bfd_reloc_code_real_type r_type;
  struct avr32_ifield_data field_value[AVR32_MAX_FIELDS];
};

static struct avr32_insn current_insn;

/* The target specific pseudo-ops we support. */
static void s_rseg (int);
static void s_cpool(int);

const pseudo_typeS md_pseudo_table[] =
{
  /* Make sure that .word is 32 bits */
  { "word", cons, 4 },
  { "file", (void (*) PARAMS ((int))) dwarf2_directive_file, 0 },
  { "loc", dwarf2_directive_loc, 0 },

  /* .lcomm requires an explicit alignment parameter */
  { "lcomm", s_lcomm, 1 },

  /* AVR32-specific pseudo-ops */
  { "cpool", s_cpool, 0},

  /* IAR compatible pseudo-ops */
  { "program", s_ignore, 0 },
  { "public", s_globl, 0 },
  { "extern", s_ignore, 0 },
  { "module", s_ignore, 0 },
  { "rseg", s_rseg, 0 },
  { "dc8", cons, 1 },
  { "dc16", cons, 2 },
  { "dc32", cons, 4 },

  { NULL, NULL, 0 }
};

/* Questionable stuff starts here */

enum avr32_opinfo {
  AVR32_OPINFO_NONE = BFD_RELOC_NONE,
  AVR32_OPINFO_GOT,
  AVR32_OPINFO_TLSGD,
  AVR32_OPINFO_HI,
  AVR32_OPINFO_LO,
};

enum avr32_arch {
  ARCH_TYPE_AP,
  ARCH_TYPE_UCR1,
  ARCH_TYPE_UCR2,
  ARCH_TYPE_UCR3,
  ARCH_TYPE_UCR3FP
};

struct arch_type_s
{
  /* Architecture name */
  char *name;
  /* Instruction Set Architecture Flags */
  unsigned long isa_flags;
};

struct part_type_s
{
  /* Part name */
  char *name;
  /* Architecture type */
  unsigned int arch;
};

static struct arch_type_s arch_types[] =
{
    {"ap", AVR32_V1 | AVR32_SIMD | AVR32_DSP | AVR32_PICO},
    {"ucr1", AVR32_V1 | AVR32_DSP | AVR32_RMW},
    {"ucr2", AVR32_V1 | AVR32_V2 | AVR32_DSP | AVR32_RMW},
    {"ucr3", AVR32_V1 | AVR32_V2 | AVR32_V3 | AVR32_DSP | AVR32_RMW},
    {"ucr3fp", AVR32_V1 | AVR32_V2 | AVR32_V3 | AVR32_DSP | AVR32_RMW | AVR32_V3FP},
    {"all-insn", AVR32_V1 | AVR32_V2 | AVR32_V3 | AVR32_SIMD | AVR32_DSP | AVR32_RMW | AVR32_V3FP | AVR32_PICO},
    {NULL, 0}
};

static struct part_type_s part_types[] =
{
    {"ap7000",        ARCH_TYPE_AP},
    {"ap7001",        ARCH_TYPE_AP},
    {"ap7002",        ARCH_TYPE_AP},
    {"ap7200",        ARCH_TYPE_AP},
    {"uc3a0128",      ARCH_TYPE_UCR2},
    {"uc3a0256",      ARCH_TYPE_UCR2},
    {"uc3a0512es",    ARCH_TYPE_UCR1},
    {"uc3a0512",      ARCH_TYPE_UCR2},
    {"uc3a1128",      ARCH_TYPE_UCR2},
    {"uc3a1256es",    ARCH_TYPE_UCR1},
    {"uc3a1256",      ARCH_TYPE_UCR2},
    {"uc3a1512es",    ARCH_TYPE_UCR1},
    {"uc3a1512",      ARCH_TYPE_UCR2},
    {"uc3a364",       ARCH_TYPE_UCR2},
    {"uc3a364s",      ARCH_TYPE_UCR2},
    {"uc3a3128",      ARCH_TYPE_UCR2},
    {"uc3a3128s",     ARCH_TYPE_UCR2},
    {"uc3a3256",      ARCH_TYPE_UCR2},
    {"uc3a3256s",     ARCH_TYPE_UCR2},
    {"uc3b064",       ARCH_TYPE_UCR1},
    {"uc3b0128",      ARCH_TYPE_UCR1},
    {"uc3b0256es",    ARCH_TYPE_UCR1},
    {"uc3b0256",      ARCH_TYPE_UCR1},
    {"uc3b0512",      ARCH_TYPE_UCR2},
    {"uc3b0512revc",  ARCH_TYPE_UCR2},
    {"uc3b164",       ARCH_TYPE_UCR1},
    {"uc3b1128",      ARCH_TYPE_UCR1},
    {"uc3b1256",      ARCH_TYPE_UCR1},
    {"uc3b1256es",    ARCH_TYPE_UCR1},
    {"uc3b1512",      ARCH_TYPE_UCR2},
    {"uc3b1512revc",  ARCH_TYPE_UCR2},
    {"uc3c0512crevc", ARCH_TYPE_UCR3},
    {"uc3c1512crevc", ARCH_TYPE_UCR3},
    {"uc3c2512crevc", ARCH_TYPE_UCR3},
    {"atuc3l0256",    ARCH_TYPE_UCR3},
    {"mxt768e",       ARCH_TYPE_UCR3},
    {"uc3l064",       ARCH_TYPE_UCR3},
    {"uc3l032",       ARCH_TYPE_UCR3},
    {"uc3l016",       ARCH_TYPE_UCR3},
    {"uc3l064revb",   ARCH_TYPE_UCR3},
    {"uc3c064c",  ARCH_TYPE_UCR3FP},
    {"uc3c0128c",   ARCH_TYPE_UCR3FP},
    {"uc3c0256c",   ARCH_TYPE_UCR3FP},
    {"uc3c0512c",   ARCH_TYPE_UCR3FP},
    {"uc3c164c",  ARCH_TYPE_UCR3FP},
    {"uc3c1128c",   ARCH_TYPE_UCR3FP},
    {"uc3c1256c",   ARCH_TYPE_UCR3FP},
    {"uc3c1512c",   ARCH_TYPE_UCR3FP},
    {"uc3c264c",  ARCH_TYPE_UCR3FP},
    {"uc3c2128c",   ARCH_TYPE_UCR3FP},
    {"uc3c2256c",   ARCH_TYPE_UCR3FP},
    {"uc3c2512c",   ARCH_TYPE_UCR3FP},
    {NULL, 0}
};

/* Current architecture type.  */
static struct arch_type_s default_arch = {"all-insn", AVR32_V1 | AVR32_V2 | AVR32_V3 | AVR32_SIMD | AVR32_DSP | AVR32_RMW | AVR32_V3FP | AVR32_PICO };
static struct arch_type_s *avr32_arch = &default_arch;

