fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
/* Display nicely formatted list of known part- and architecture names.  */

static void
show_arch_list (FILE *stream)
{
  int i, x;

  fprintf (stream, _("Known architecture names:"));
  x = 1000;

  for (i = 0; arch_types[i].name; i++)
    {
      int len = strlen (arch_types[i].name);

      x += len + 1;

      if (x < 75)
	fprintf (stream, " %s", arch_types[i].name);
      else
	{
	  fprintf (stream, "\n  %s", arch_types[i].name);
	  x = len + 2;
	}
    }

  fprintf (stream, "\n");
}

static void
show_part_list (FILE *stream)
{
  int i, x;

  fprintf (stream, _("Known part names:"));
  x = 1000;

  for (i = 0; part_types[i].name; i++)
    {
      int len = strlen(part_types[i].name);

      x += len + 1;

      if (x < 75)
	fprintf (stream, " %s", part_types[i].name);
      else
	{
	  fprintf(stream, "\n  %s", part_types[i].name);
	  x = len + 2;
	}
    }

  fprintf (stream, "\n");
}

const char *md_shortopts = "";
struct option md_longopts[] =
{
#define OPTION_ARCH		(OPTION_MD_BASE)
#define OPTION_PART		(OPTION_ARCH + 1)
#define OPTION_IAR		(OPTION_PART + 1)
#define OPTION_PIC		(OPTION_IAR + 1)
#define OPTION_NOPIC		(OPTION_PIC + 1)
#define OPTION_LINKRELAX	(OPTION_NOPIC + 1)
#define OPTION_NOLINKRELAX	(OPTION_LINKRELAX + 1)
#define OPTION_DIRECT_DATA_REFS (OPTION_NOLINKRELAX + 1)
  {"march",		required_argument, NULL, OPTION_ARCH},
  {"mpart",		required_argument, NULL, OPTION_PART},
  {"iar",		no_argument, NULL, OPTION_IAR},
  {"pic",		no_argument, NULL, OPTION_PIC},
  {"no-pic",		no_argument, NULL, OPTION_NOPIC},
  {"linkrelax",		no_argument, NULL, OPTION_LINKRELAX},
  {"no-linkrelax",	no_argument, NULL, OPTION_NOLINKRELAX},
  /* deprecated alias for -mpart=xxx */
  {"mcpu",		required_argument, NULL, OPTION_PART},
  {NULL,		no_argument, NULL, 0}
};

size_t md_longopts_size = sizeof (md_longopts);

void
md_show_usage (FILE *stream)
{
  fprintf (stream, _("\
AVR32 options:\n\
  -march=[arch-name]      Select cpu architecture. [Default `all-insn']\n\
  -mpart=[part-name]      Select specific part. [Default `none']\n\
  --pic                   Produce Position-Independent Code\n\
  --no-pic                Don't produce Position-Independent Code\n\
  --linkrelax             Produce output suitable for linker relaxing\n\
  --no-linkrelax          Don't produce output suitable for linker relaxing\n"));
  show_arch_list(stream);
}

int
md_parse_option (int c, char *arg ATTRIBUTE_UNUSED)
{
  switch (c)
    {
    case OPTION_ARCH:
      {
	int i;
	char *s = alloca (strlen (arg) + 1);

	{
	  char *t = s;
	  char *arg1 = arg;

	  do
	    *t = TOLOWER (*arg1++);
	  while (*t++);
	}

        /* Add backward compability */
        if (strcmp ("uc", s)== 0)
          {
            as_warn("Deprecated arch `%s' specified. "
                    "Please use '-march=ucr1' instead. "
                    "Converting to arch 'ucr1'\n",
                     s);
            s="ucr1";
          }

	for (i = 0; arch_types[i].name; ++i)
	  if (strcmp (arch_types[i].name, s) == 0)
	    break;

	if (!arch_types[i].name)
	  {
	    show_arch_list (stderr);
	    as_fatal (_("unknown architecture: %s\n"), arg);
	  }

        avr32_arch = &arch_types[i];
	break;
      }
    case OPTION_PART:
      {
	int i;
	char *s = alloca (strlen (arg) + 1);
	char *t = s;
	char *p = arg;

	/* If arch type has already been set, don't bother.
	   -march= always overrides -mpart=  */
	if (avr32_arch != &default_arch)
	  break;

	do
	  *t = TOLOWER (*p++);
	while (*t++);

	for (i = 0; part_types[i].name; ++i)
	  if (strcmp (part_types[i].name, s) == 0)
	    break;

	if (!part_types[i].name)
	  {
	    show_part_list (stderr);
	    as_fatal (_("unknown part: %s\n"), arg);
	  }

	avr32_arch = &arch_types[part_types[i].arch];
	break;
      }
    case OPTION_IAR:
      avr32_iarcompat = 1;
      break;
    case OPTION_PIC:
      avr32_pic = 1;
      break;
    case OPTION_NOPIC:
      avr32_pic = 0;
      break;
    case OPTION_LINKRELAX:
      linkrelax = 1;
      break;
    case OPTION_NOLINKRELAX:
      linkrelax = 0;
      break;
    default:
      return 0;
    }
  return 1;
}

/* Can't use symbol_new here, so have to create a symbol and then at
   a later date assign it a value. Thats what these functions do.

   Shamelessly stolen from ARM.  */

static void
symbol_locate (symbolS *    symbolP,
	       const char * name,	/* It is copied, the caller can modify.  */
	       segT         segment,	/* Segment identifier (SEG_<something>).  */
	       valueT       valu,	/* Symbol value.  */
	       fragS *      frag)	/* Associated fragment.  */
{
  unsigned int name_length;
  char * preserved_copy_of_name;

  name_length = strlen (name) + 1;   /* +1 for \0.  */
  obstack_grow (&notes, name, name_length);
  preserved_copy_of_name = obstack_finish (&notes);
#ifdef STRIP_UNDERSCORE
  if (preserved_copy_of_name[0] == '_')
    preserved_copy_of_name++;
#endif

#ifdef tc_canonicalize_symbol_name
  preserved_copy_of_name =
    tc_canonicalize_symbol_name (preserved_copy_of_name);
#endif

  S_SET_NAME (symbolP, preserved_copy_of_name);

  S_SET_SEGMENT (symbolP, segment);
  S_SET_VALUE (symbolP, valu);
  symbol_clear_list_pointers (symbolP);

  symbol_set_frag (symbolP, frag);

  /* Link to end of symbol chain.  */
  {
    extern int symbol_table_frozen;

    if (symbol_table_frozen)
      abort ();
  }

  symbol_append (symbolP, symbol_lastP, & symbol_rootP, & symbol_lastP);

  obj_symbol_new_hook (symbolP);

#ifdef tc_symbol_new_hook
  tc_symbol_new_hook (symbolP);
#endif

#ifdef DEBUG_SYMS
  verify_symbol_chain (symbol_rootP, symbol_lastP);
#endif /* DEBUG_SYMS  */
}

struct cpool_entry
{
  int			refcount;
  offsetT		offset;
  expressionS		exp;
};

struct cpool
{
  struct cpool		*next;
  int			used;
  struct cpool_entry	*literals;
  unsigned int		padding;
  unsigned int		next_free_entry;
  unsigned int		id;
  symbolS		*symbol;
  segT			section;
  subsegT		sub_section;
};

struct cpool *cpool_list = NULL;

static struct cpool *
find_cpool(segT section, subsegT sub_section)
{
  struct cpool *pool;

  for (pool = cpool_list; pool != NULL; pool = pool->next)
    {
      if (!pool->used
	  && pool->section == section
	  && pool->sub_section == sub_section)
	break;
    }

  return pool;
}

