fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
static struct cpool *
find_or_make_cpool(segT section, subsegT sub_section)
{
  static unsigned int next_cpool_id = 0;
  struct cpool *pool;

  pool = find_cpool(section, sub_section);

  if (!pool)
    {
      pool = xmalloc(sizeof(*pool));
      if (!pool)
	return NULL;

      pool->used = 0;
      pool->literals = NULL;
      pool->padding = 0;
      pool->next_free_entry = 0;
      pool->section = section;
      pool->sub_section = sub_section;
      pool->next = cpool_list;
      pool->symbol = NULL;

      cpool_list = pool;
    }

  /* NULL symbol means that the pool is new or has just been emptied.  */
  if (!pool->symbol)
    {
      pool->symbol = symbol_create(FAKE_LABEL_NAME, undefined_section,
				   0, &zero_address_frag);
      pool->id = next_cpool_id++;
    }

  return pool;
}

static struct cpool *
add_to_cpool(expressionS *exp, unsigned int *index, int ref)
{
  struct cpool *pool;
  unsigned int entry;

  pool = find_or_make_cpool(now_seg, now_subseg);

  /* Check if this constant is already in the pool.  */
  for (entry = 0; entry < pool->next_free_entry; entry++)
    {
      if ((pool->literals[entry].exp.X_op == exp->X_op)
	  && (exp->X_op == O_constant)
	  && (pool->literals[entry].exp.X_add_number
	      == exp->X_add_number)
	  && (pool->literals[entry].exp.X_unsigned
	      == exp->X_unsigned))
	break;

      if ((pool->literals[entry].exp.X_op == exp->X_op)
	  && (exp->X_op == O_symbol)
	  && (pool->literals[entry].exp.X_add_number
	      == exp->X_add_number)
	  && (pool->literals[entry].exp.X_add_symbol
	      == exp->X_add_symbol)
	  && (pool->literals[entry].exp.X_op_symbol
	      == exp->X_op_symbol))
	break;
    }

  /* Create an entry if we didn't find a match */
  if (entry == pool->next_free_entry)
    {
      pool->literals = xrealloc(pool->literals,
				sizeof(struct cpool_entry) * (entry + 1));
      pool->literals[entry].exp = *exp;
      pool->literals[entry].refcount = 0;
      pool->next_free_entry++;
    }

  if (index)
    *index = entry;
  if (ref)
    pool->literals[entry].refcount++;

  return pool;
}

struct avr32_operand
{
  int id;
  int is_signed;
  int is_pcrel;
  int align_order;
  int (*match)(char *str);
  void (*parse)(const struct avr32_operand *op, char *str, int opindex);
};

static int
match_anything(char *str ATTRIBUTE_UNUSED)
{
  return 1;
}

static int
match_intreg(char *str)
{
  int regid, ret = 1;

  regid = avr32_parse_intreg(str);
  if (regid < 0)
    ret = 0;

  pr_debug("match_intreg: `%s': %d\n", str, ret);

  return ret;
}

static int
match_intreg_predec(char *str)
{
  int regid;

  if (str[0] != '-' || str[1] != '-')
    return 0;

  regid = avr32_parse_intreg(str + 2);
  if (regid < 0)
    return 0;

  return 1;
}

static int
match_intreg_postinc(char *str)
{
  int regid, ret = 1;
  char *p, c;

  for (p = str; *p; p++)
    if (*p == '+')
      break;

  if (p[0] != '+' || p[1] != '+')
    return 0;

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  if (regid < 0)
    ret = 0;

  *p = c;
  return ret;
}

static int
match_intreg_lsl(char *str)
{
  int regid, ret = 1;
  char *p, c;

  for (p = str; *p; p++)
    if (*p == '<')
      break;

  if (p[0] && p[1] != '<')
    return 0;

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  if (regid < 0)
    ret = 0;

  *p = c;
  return ret;
}

static int
match_intreg_lsr(char *str)
{
  int regid, ret = 1;
  char *p, c;

  for (p = str; *p; p++)
    if (*p == '>')
      break;

  if (p[0] && p[1] != '>')
    return 0;

  c = *p, *p = 0;

  regid = avr32_parse_intreg(str);
  if (regid < 0)
    ret = 0;

  *p = c;
  return ret;
}

static int
match_intreg_part(char *str)
{
  int regid, ret = 1;
  char *p, c;

  for (p = str; *p; p++)
    if (*p == ':')
      break;

  if (p[0] != ':' || !ISPRINT(p[1]) || p[2] != '\0')
    return 0;

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  if (regid < 0)
    ret = 0;

  *p = c;

  return ret;
}

#define match_intreg_disp match_anything

static int
match_intreg_index(char *str)
{
  int regid, ret = 1;
  char *p, *end, c;

  for (p = str; *p; p++)
    if (*p == '[')
      break;

  /* don't allow empty displacement here (it makes no sense) */
  if (p[0] != '[')
    return 0;

  for (end = p + 1; *end; end++) ;
  if (*(--end) != ']')
    return 0;

  c = *end, *end = 0;
  if (!match_intreg_lsl(p + 1))
    ret = 0;
  *end = c;

  if (ret)
    {
      c = *p, *p = 0;
      regid = avr32_parse_intreg(str);
      if (regid < 0)
	ret = 0;
      *p = c;
    }

  return ret;
}

static int
match_intreg_xindex(char *str)
{
  int regid, ret = 1;
  char *p, *end, c;

  for (p = str; *p; p++)
    if (*p == '[')
      break;

  /* empty displacement makes no sense here either */
  if (p[0] != '[')
    return 0;

  for (end = p + 1; *end; end++)
    if (*end == '<')
      break;

  if (!streq(end, "<<2]"))
    return 0;

  c = *end, *end = 0;
  if (!match_intreg_part(p + 1))
    ret = 0;
  *end = c;

  if (ret)
    {
      c = *p, *p = 0;
      regid = avr32_parse_intreg(str);
      if (regid < 0)
	ret = 0;
      *p = c;
    }

  return ret;
}

/* The PC_UDISP_W operator may show up as a label or as a pc[disp]
   expression.  So there's no point in attempting to match this...  */
#define match_pc_disp	match_anything

static int
match_sp(char *str)
{
  /* SP in any form will do */
  return avr32_parse_intreg(str) == AVR32_REG_SP;
}

static int
match_sp_disp(char *str)
{
  int regid, ret = 1;
  char *p, c;

  for (p = str; *p; p++)
    if (*p == '[')
      break;

  /* allow empty displacement, meaning zero */
  if (p[0] == '[')
    {
      char *end;
      for (end = p + 1; *end; end++) ;
      if (end[-1] != ']')
	return 0;
    }

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  if (regid != AVR32_REG_SP)
    ret = 0;

  *p = c;
  return ret;
}

static int
match_cpno(char *str)
{
  if (strncasecmp(str, "cp", 2) != 0)
    return 0;
  return 1;
}

static int
match_cpreg(char *str)
{
  if (strncasecmp(str, "cr", 2) != 0)
    return 0;
  return 1;
}

/* We allow complex expressions, and register names may show up as
   symbols.  Just make sure immediate expressions are always matched
   last.  */
#define match_const		match_anything
#define match_jmplabel		match_anything
#define match_number		match_anything

/* Mnemonics that take reglists never accept anything else */
#define match_reglist8		match_anything
#define match_reglist9		match_anything
#define match_reglist16		match_anything
#define match_reglist_ldm	match_anything
#define match_reglist_cp8	match_anything
#define match_reglist_cpd8	match_anything

/* Ditto for retval, jospinc and mcall */
#define match_retval		match_anything
#define match_jospinc		match_anything
#define match_mcall		match_anything

/* COH is used to select between two different syntaxes */
static int
match_coh(char *str)
{
  return strcasecmp(str, "coh") == 0;
}
#if 0
static int
match_fpreg(char *str)
{
  unsigned long regid;
  char *endptr;

  if ((str[0] != 'f' && str[0] != 'F')
      || (str[1] != 'r' && str[1] != 'R'))
    return 0;

