fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  str += 2;
  regid = strtoul(str, &endptr, 10);
  if (!*str || *endptr)
    return 0;

  return 1;
}
#endif

static int
match_picoreg(char *str)
{
  int regid;

  regid = avr32_parse_picoreg(str);
  if (regid < 0)
    return 0;
  return 1;
}

#define match_pico_reglist_w	match_anything
#define match_pico_reglist_d	match_anything

static int
match_pico_in(char *str)
{
  unsigned long regid;
  char *end;

  if (strncasecmp(str, "in", 2) != 0)
    return 0;

  str += 2;
  regid = strtoul(str, &end, 10);
  if (!*str || *end)
    return 0;

  return 1;
}

static int
match_pico_out0(char *str)
{
  if (strcasecmp(str, "out0") != 0)
    return 0;
  return 1;
}

static int
match_pico_out1(char *str)
{
  if (strcasecmp(str, "out1") != 0)
    return 0;
  return 1;
}

static int
match_pico_out2(char *str)
{
  if (strcasecmp(str, "out2") != 0)
    return 0;
  return 1;
}

static int
match_pico_out3(char *str)
{
  if (strcasecmp(str, "out3") != 0)
    return 0;
  return 1;
}

static void parse_nothing(const struct avr32_operand *op ATTRIBUTE_UNUSED,
			  char *str ATTRIBUTE_UNUSED,
			  int opindex ATTRIBUTE_UNUSED)
{
  /* Do nothing (this is used for "match-only" operands like COH) */
}

static void
parse_const(const struct avr32_operand *op, char *str,
	    int opindex ATTRIBUTE_UNUSED)
{
  expressionS *exp = &current_insn.immediate;
  expressionS *sym_exp;
  int slot;
  char *save;

  pr_debug("parse_const: `%s' (signed: %d, pcrel: %d, align: %d)\n",
	   str, op->is_signed, op->is_pcrel, op->align_order);

  save = input_line_pointer;
  input_line_pointer = str;

  expression(exp);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].align_order = op->align_order;
  current_insn.pcrel = op->is_pcrel;

  switch (exp->X_op)
    {
    case O_illegal:
      as_bad(_("illegal operand"));
      break;
    case O_absent:
      as_bad(_("missing operand"));
      break;
    case O_constant:
      pr_debug("  -> constant: %ld\n", (long)exp->X_add_number);
      current_insn.field_value[slot].value = exp->X_add_number;
      break;
    case O_uminus:
      pr_debug("  -> uminus\n");
      sym_exp = symbol_get_value_expression(exp->X_add_symbol);
      switch (sym_exp->X_op) {
      case O_subtract:
	pr_debug("     -> subtract: switching operands\n");
	exp->X_op_symbol = sym_exp->X_add_symbol;
	exp->X_add_symbol = sym_exp->X_op_symbol;
	exp->X_op = O_subtract;
	/* TODO: Remove the old X_add_symbol */
	break;
      default:
	as_bad(_("Expression too complex\n"));
	break;
      }
      break;
#if 0
    case O_subtract:
      /* Any expression subtracting a symbol from the current section
	 can be made PC-relative by adding the right offset.  */
      if (S_GET_SEGMENT(exp->X_op_symbol) == now_seg)
	current_insn.pcrel = TRUE;
      pr_debug("  -> subtract: pcrel? %s\n",
	       current_insn.pcrel ? "yes" : "no");
      /* fall through */
#endif
    default:
      pr_debug("  -> (%p <%d> %p + %d)\n",
	       exp->X_add_symbol, exp->X_op, exp->X_op_symbol,
	       exp->X_add_number);
      current_insn.field_value[slot].value = 0;
      break;
    }

  input_line_pointer = save;
}

static void
parse_jmplabel(const struct avr32_operand *op, char *str,
	       int opindex ATTRIBUTE_UNUSED)
{
  expressionS *exp = &current_insn.immediate;
  int slot;
  char *save;

  pr_debug("parse_jmplabel: `%s' (signed: %d, pcrel: %d, align: %d)\n",
	   str, op->is_signed, op->is_pcrel, op->align_order);

  save = input_line_pointer;
  input_line_pointer = str;

  expression(exp);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].align_order = op->align_order;
  current_insn.pcrel = TRUE;

  switch (exp->X_op)
    {
    case O_illegal:
      as_bad(_("illegal operand"));
      break;
    case O_absent:
      as_bad(_("missing operand"));
      break;
    case O_constant:
      pr_debug("  -> constant: %ld\n", (long)exp->X_add_number);
      current_insn.field_value[slot].value = exp->X_add_number;
      current_insn.pcrel = 0;
      break;
    default:
      pr_debug("  -> (%p <%d> %p + %d)\n",
	       exp->X_add_symbol, exp->X_op, exp->X_op_symbol,
	       exp->X_add_number);
      current_insn.field_value[slot].value = 0;
      break;
    }

  input_line_pointer = save;
}

static void
parse_intreg(const struct avr32_operand *op ATTRIBUTE_UNUSED,
	     char *str, int opindex ATTRIBUTE_UNUSED)
{
  int regid, slot;

  pr_debug("parse_intreg: `%s'\n", str);

  regid = avr32_parse_intreg(str);
  assert(regid >= 0);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;
  current_insn.field_value[slot].align_order = op->align_order;
}

static void
parse_intreg_predec(const struct avr32_operand *op, char *str, int opindex)
{
  parse_intreg(op, str + 2, opindex);
}

static void
parse_intreg_postinc(const struct avr32_operand *op, char *str, int opindex)
{
  char *p, c;

  pr_debug("parse_intreg_postinc: `%s'\n", str);

  for (p = str; *p != '+'; p++) ;

  c = *p, *p = 0;
  parse_intreg(op, str, opindex);
  *p = c;
}

static void
parse_intreg_shift(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		   char *str, int opindex ATTRIBUTE_UNUSED)
{
  int regid, slot, shift = 0;
  char *p, c;
  char shiftop;

  pr_debug("parse Ry<<sa: `%s'\n", str);

  for (p = str; *p; p++)
    if (*p == '<' || *p == '>')
      break;

  shiftop = *p;

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  assert(regid >= 0);
  *p = c;

  if (c)
    {
      if (p[0] != shiftop || p[1] != shiftop)
	as_bad(_("expected shift operator in `%s'"), p);
      else
	{
	  expressionS exp;
	  char *saved;

	  saved = input_line_pointer;
	  input_line_pointer = p + 2;
	  expression(&exp);
	  input_line_pointer = saved;

	  if (exp.X_op != O_constant)
	    as_bad(_("shift amount must be a numeric constant"));
	  else
	    shift = exp.X_add_number;
	}
    }

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;
  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = shift;
}

/* The match() function selected the right opcode, so it doesn't
   matter which way we shift any more.  */
#define parse_intreg_lsl	parse_intreg_shift
#define parse_intreg_lsr	parse_intreg_shift

static void
parse_intreg_part(const struct avr32_operand *op, char *str,
		  int opindex ATTRIBUTE_UNUSED)
{
  static const char bparts[] = { 'b', 'l', 'u', 't' };
  static const char hparts[] = { 'b', 't' };
  unsigned int slot, sel;
  int regid;
  char *p, c;

