fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  pr_debug("parse reg:part `%s'\n", str);

  for (p = str; *p; p++)
    if (*p == ':')
      break;

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  assert(regid >= 0);
  *p = c;

  assert(c == ':');

  if (op->align_order)
    {
      for (sel = 0; sel < sizeof(hparts); sel++)
	if (TOLOWER(p[1]) == hparts[sel])
	  break;

      if (sel >= sizeof(hparts))
	{
	  as_bad(_("invalid halfword selector `%c' (must be either b or t)"),
		 p[1]);
	  sel = 0;
	}
    }
  else
    {
      for (sel = 0; sel < sizeof(bparts); sel++)
	if (TOLOWER(p[1]) == bparts[sel])
	  break;

      if (sel >= sizeof(bparts))
	{
	  as_bad(_("invalid byte selector `%c' (must be one of b,l,u,t)"),
		 p[1]);
	  sel = 0;
	}
    }

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;
  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = sel;
}

/* This is the parser for "Rp[displacement]" expressions.  In addition
   to the "official" syntax, we accept a label as a replacement for
   the register expression.  This syntax implies Rp=PC and the
   displacement is the pc-relative distance to the label.  */
static void
parse_intreg_disp(const struct avr32_operand *op, char *str, int opindex)
{
  expressionS *exp = &current_insn.immediate;
  int slot, regid;
  char *save, *p, c;

  pr_debug("parse_intreg_disp: `%s' (signed: %d, pcrel: %d, align: %d)\n",
	   str, op->is_signed, op->is_pcrel, op->align_order);

  for (p = str; *p; p++)
    if (*p == '[')
      break;

  slot = current_insn.next_slot++;

  /* First, check if we have a valid register either before '[' or as
     the sole expression.  If so, we use the Rp[disp] syntax.  */
  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  *p = c;

  if (regid >= 0)
    {
      current_insn.field_value[slot].value = regid;

      slot = current_insn.next_slot++;
      current_insn.field_value[slot].align_order = op->align_order;

      if (c == '[')
	{
	  save = input_line_pointer;
	  input_line_pointer = p + 1;

	  expression(exp);

	  if (*input_line_pointer != ']')
	    as_bad(_("junk after displacement expression"));

	  input_line_pointer = save;

	  switch (exp->X_op)
	    {
	    case O_illegal:
	      as_bad(_("illegal displacement expression"));
	      break;
	    case O_absent:
	      as_bad(_("missing displacement expression"));
	      break;
	    case O_constant:
	      pr_debug("  -> constant: %ld\n", exp->X_add_number);
	      current_insn.field_value[slot].value = exp->X_add_number;
	      break;
#if 0
	    case O_subtract:
	      if (S_GET_SEGMENT(exp->X_op_symbol) == now_seg)
		current_insn.pcrel = TRUE;
	      pr_debug("  -> subtract: pcrel? %s\n",
		       current_insn.pcrel ? "yes" : "no");
	      /* fall through */
#endif
	    default:
	      pr_debug("  -> (%p <%d> %p + %d)\n",
		       exp->X_add_symbol, exp->X_op, exp->X_op_symbol,
		       exp->X_add_number);
	      current_insn.field_value[slot].value = 0;
	    }
	}
      else
	{
	  exp->X_op = O_constant;
	  exp->X_add_number = 0;
	  current_insn.field_value[slot].value = 0;
	}
    }
  else
    {
      /* Didn't find a valid register.  Try parsing it as a label.  */
      current_insn.field_value[slot].value = AVR32_REG_PC;
      parse_jmplabel(op, str, opindex);
    }
}

static void
parse_intreg_index(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		   char *str, int opindex ATTRIBUTE_UNUSED)
{
  int slot, regid;
  char *p, *end, c;

  for (p = str; *p; p++)
    if (*p == '[')
      break;

  assert(*p);

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  assert(regid >= 0);
  *p = c;

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;

  p++;
  for (end = p; *end; end++)
    if (*end == ']' || *end == '<')
      break;

  assert(*end);

  c = *end, *end = 0;
  regid = avr32_parse_intreg(p);
  assert(regid >= 0);
  *end = c;

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = 0;

  if (*end == '<')
    {
      expressionS exp;
      char *save;

      p = end + 2;
      for (end = p; *end; end++)
	if (*end == ']')
	  break;

      assert(*end == ']');

      c = *end, *end = 0;
      save = input_line_pointer;
      input_line_pointer = p;
      expression(&exp);

      if (*input_line_pointer)
	as_bad(_("junk after shift expression"));

      *end = c;
      input_line_pointer = save;

      if (exp.X_op == O_constant)
	current_insn.field_value[slot].value = exp.X_add_number;
      else
	as_bad(_("shift expression too complex"));
    }
}

static void
parse_intreg_xindex(const struct avr32_operand *op, char *str, int opindex)
{
  int slot, regid;
  char *p, *end, c;

  for (p = str; *p; p++)
    if (*p == '[')
      break;

  assert(*p);

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  assert(regid >= 0);
  *p = c;

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;

  p++;
  for (end = p; *end; end++)
    if (*end == '<')
      break;

  assert(*end);

  c = *end, *end = 0;
  parse_intreg_part(op, p, opindex);
  *end = c;
}

static void
parse_pc_disp(const struct avr32_operand *op, char *str, int opindex)
{
  char *p, c;

  for (p = str; *p; p++)
    if (*p == '[')
      break;

  /* The lddpc instruction comes in two different syntax variants:
       lddpc reg, expression
       lddpc reg, pc[disp]
     If the operand contains a '[', we use the second form.  */
  if (*p)
    {
      int regid;

      c = *p, *p = 0;
      regid = avr32_parse_intreg(str);
      *p = c;
      if (regid == AVR32_REG_PC)
	{
	  char *end;

	  for (end = ++p; *end; end++) ;
	  if (*(--end) != ']')
	    as_bad(_("unrecognized form of instruction: `%s'"), str);
	  else
	    {
	      c = *end, *end = 0;
	      parse_const(op, p, opindex);
	      *end = c;
	      current_insn.pcrel = 0;
	    }
	}
      else
	as_bad(_("unrecognized form of instruction: `%s'"), str);
    }
  else
    {
      parse_jmplabel(op, str, opindex);
    }
}

