fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
static void parse_sp(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		     char *str ATTRIBUTE_UNUSED,
		     int opindex ATTRIBUTE_UNUSED)
{
  int slot;

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = AVR32_REG_SP;
}

static void
parse_sp_disp(const struct avr32_operand *op, char *str, int opindex)
{
  char *p, c;

  for (; *str; str++)
    if (*str == '[')
      break;

  assert(*str);

  for (p = ++str; *p; p++)
    if (*p == ']')
      break;

  c = *p, *p = 0;
  parse_const(op, str, opindex);
  *p = c;
}

static void
parse_cpno(const struct avr32_operand *op ATTRIBUTE_UNUSED, char *str,
	   int opindex ATTRIBUTE_UNUSED)
{
  int slot;

  str += 2;
  if (*str == '#')
    str++;
  if (*str < '0' || *str > '7' || str[1])
    as_bad(_("invalid coprocessor `%s'"), str);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = *str - '0';
}

static void
parse_cpreg(const struct avr32_operand *op, char *str,
	    int opindex ATTRIBUTE_UNUSED)
{
  unsigned int crid;
  int slot;
  char *endptr;

  str += 2;
  crid = strtoul(str, &endptr, 10);
  if (*endptr || crid > 15 || crid & ((1 << op->align_order) - 1))
    as_bad(_("invalid coprocessor register `%s'"), str);

  crid >>= op->align_order;

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = crid;
}

static void
parse_number(const struct avr32_operand *op, char *str,
	     int opindex ATTRIBUTE_UNUSED)
{
  expressionS exp;
  int slot;
  char *save;

  save = input_line_pointer;
  input_line_pointer = str;
  expression(&exp);
  input_line_pointer = save;

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].align_order = op->align_order;

  if (exp.X_op == O_constant)
      current_insn.field_value[slot].value = exp.X_add_number;
  else
      as_bad(_("invalid numeric expression `%s'"), str);
}

static void
parse_reglist8(const struct avr32_operand *op ATTRIBUTE_UNUSED,
	       char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask;
  unsigned long value = 0;
  int slot;
  char *tail;

  regmask = avr32_parse_reglist(str, &tail);
  if (*tail)
    as_bad(_("invalid register list `%s'"), str);
  else
    {
      if (avr32_make_regmask8(regmask, &value))
	as_bad(_("register list `%s' doesn't fit"), str);
    }

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = value;
}

static int
parse_reglist_tail(char *str, unsigned long regmask)
{
  expressionS exp;
  char *save, *p, c;
  int regid;

  for (p = str + 1; *p; p++)
    if (*p == '=')
      break;

  if (!*p)
    {
      as_bad(_("invalid register list `%s'"), str);
      return -2;
    }

  c = *p, *p = 0;
  regid = avr32_parse_intreg(str);
  *p = c;

  if (regid != 12)
    {
      as_bad(_("invalid register list `%s'"), str);
      return -2;
    }

  /* If we have an assignment, we must pop PC and we must _not_
     pop LR or R12 */
  if (!(regmask & (1 << AVR32_REG_PC)))
    {
      as_bad(_("return value specified for non-return instruction"));
      return -2;
    }
  else if (regmask & ((1 << AVR32_REG_R12) | (1 << AVR32_REG_LR)))
    {
      as_bad(_("can't pop LR or R12 when specifying return value"));
      return -2;
    }

  save = input_line_pointer;
  input_line_pointer = p + 1;
  expression(&exp);
  input_line_pointer = save;

  if (exp.X_op != O_constant
      || exp.X_add_number < -1
      || exp.X_add_number > 1)
    {
      as_bad(_("invalid return value `%s'"), str);
      return -2;
    }

  return exp.X_add_number;
}

static void
parse_reglist9(const struct avr32_operand *op ATTRIBUTE_UNUSED,
	       char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask;
  unsigned long value = 0, kbit = 0;
  int slot;
  char *tail;

  regmask = avr32_parse_reglist(str, &tail);
  /* printf("parsed reglist16: %04lx, tail: `%s'\n", regmask, tail); */
  if (*tail)
    {
      int retval;

      retval = parse_reglist_tail(tail, regmask);

      switch (retval)
	{
	case -1:
	  regmask |= 1 << AVR32_REG_LR;
	  break;
	case 0:
	  break;
	case 1:
	  regmask |= 1 << AVR32_REG_R12;
	  break;
	default:
	  break;
	}

      kbit = 1;
    }

  if (avr32_make_regmask8(regmask, &value))
    as_bad(_("register list `%s' doesn't fit"), str);


  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = (value << 1) | kbit;
}

static void
parse_reglist16(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask;
  int slot;
  char *tail;

  regmask = avr32_parse_reglist(str, &tail);
  if (*tail)
    as_bad(_("invalid register list `%s'"), str);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regmask;
}

static void
parse_reglist_ldm(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		  char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask;
  int slot, rp, w_bit = 0;
  char *tail, *p, c;

  for (p = str; *p && *p != ','; p++)
    if (*p == '+')
      break;

  c = *p, *p = 0;
  rp = avr32_parse_intreg(str);
  *p = c;
  if (rp < 0)
    {
      as_bad(_("invalid destination register in `%s'"), str);
      return;
    }

  if (p[0] == '+' && p[1] == '+')
    {
      w_bit = 1;
      p += 2;
    }

  if (*p != ',')
    {
      as_bad(_("expected `,' after destination register in `%s'"), str);
      return;
    }

  str = p + 1;
  regmask = avr32_parse_reglist(str, &tail);
  if (*tail)
    {
      int retval;

      if (rp != AVR32_REG_SP)
	{
	  as_bad(_("junk at end of line: `%s'"), tail);
	  return;
	}

      rp = AVR32_REG_PC;

      retval = parse_reglist_tail(tail, regmask);

      switch (retval)
	{
	case -1:
	  regmask |= 1 << AVR32_REG_LR;
	  break;
	case 0:
	  break;
	case 1:
	  regmask |= 1 << AVR32_REG_R12;
	  break;
	default:
	  return;
	}
    }

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = rp;
  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = w_bit;
  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regmask;
}

static void
parse_reglist_cp8(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		  char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask;
  int slot, h_bit = 0;
  char *tail;

