fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  regmask = avr32_parse_cpreglist(str, &tail);
  if (*tail)
    as_bad(_("junk at end of line: `%s'"), tail);
  else if (regmask & 0xffUL)
    {
      if (regmask & 0xff00UL)
	as_bad(_("register list `%s' doesn't fit"), str);
      regmask &= 0xff;
    }
  else if (regmask & 0xff00UL)
    {
      regmask >>= 8;
      h_bit = 1;
    }
  else
    as_warn(_("register list is empty"));

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regmask;
  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = h_bit;
}

static void
parse_reglist_cpd8(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		   char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask, regmask_d = 0;
  int slot, i;
  char *tail;

  regmask = avr32_parse_cpreglist(str, &tail);
  if (*tail)
    as_bad(_("junk at end of line: `%s'"), tail);

  for (i = 0; i < 8; i++)
    {
      if (regmask & 1)
	{
	  if (!(regmask & 2))
	    {
	      as_bad(_("register list `%s' doesn't fit"), str);
	      break;
	    }
	  regmask_d |= 1 << i;
	}
      else if (regmask & 2)
	{
	  as_bad(_("register list `%s' doesn't fit"), str);
	  break;
	}

      regmask >>= 2;
    }

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regmask_d;
}

static void
parse_retval(const struct avr32_operand *op ATTRIBUTE_UNUSED,
	     char *str, int opindex ATTRIBUTE_UNUSED)
{
  int regid, slot;

  regid = avr32_parse_intreg(str);
  if (regid < 0)
    {
      expressionS exp;
      char *save;

      regid = 0;

      save = input_line_pointer;
      input_line_pointer = str;
      expression(&exp);
      input_line_pointer = save;

      if (exp.X_op != O_constant)
	as_bad(_("invalid return value `%s'"), str);
      else
	switch (exp.X_add_number)
	  {
	  case -1:
	    regid = AVR32_REG_LR;
	    break;
	  case 0:
	    regid = AVR32_REG_SP;
	    break;
	  case 1:
	    regid = AVR32_REG_PC;
	    break;
	  default:
	    as_bad(_("invalid return value `%s'"), str);
	    break;
	  }
    }

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;
}

#define parse_mcall parse_intreg_disp

static void
parse_jospinc(const struct avr32_operand *op ATTRIBUTE_UNUSED,
	      char *str, int opindex ATTRIBUTE_UNUSED)
{
  expressionS exp;
  int slot;
  char *save;

  save = input_line_pointer;
  input_line_pointer = str;
  expression(&exp);
  input_line_pointer = save;

  slot = current_insn.next_slot++;

  if (exp.X_op == O_constant)
    {
      if (exp.X_add_number > 0)
	exp.X_add_number--;
      current_insn.field_value[slot].value = exp.X_add_number;
    }
  else
    as_bad(_("invalid numeric expression `%s'"), str);
}

#define parse_coh		parse_nothing
#if 0
static void
parse_fpreg(const struct avr32_operand *op,
	    char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regid;
  int slot;

  regid = strtoul(str + 2, NULL, 10);

  if ((regid >= 16) || (regid & ((1 << op->align_order) - 1)))
    as_bad(_("invalid floating-point register `%s'"), str);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;
  current_insn.field_value[slot].align_order = op->align_order;
}
#endif

static void
parse_picoreg(const struct avr32_operand *op,
	      char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regid;
  int slot;

  regid = avr32_parse_picoreg(str);
  if (regid & ((1 << op->align_order) - 1))
    as_bad(_("invalid double-word PiCo register `%s'"), str);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;
  current_insn.field_value[slot].align_order = op->align_order;
}

static void
parse_pico_reglist_w(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		     char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask;
  int slot, h_bit = 0;
  char *tail;

  regmask = avr32_parse_pico_reglist(str, &tail);
  if (*tail)
    as_bad(_("junk at end of line: `%s'"), tail);

  if (regmask & 0x00ffUL)
    {
      if (regmask & 0xff00UL)
	as_bad(_("register list `%s' doesn't fit"), str);
      regmask &= 0x00ffUL;
    }
  else if (regmask & 0xff00UL)
    {
      regmask >>= 8;
      h_bit = 1;
    }
  else
    as_warn(_("register list is empty"));

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regmask;
  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = h_bit;
}

static void
parse_pico_reglist_d(const struct avr32_operand *op ATTRIBUTE_UNUSED,
		     char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regmask, regmask_d = 0;
  int slot, i;
  char *tail;

  regmask = avr32_parse_pico_reglist(str, &tail);
  if (*tail)
    as_bad(_("junk at end of line: `%s'"), tail);

  for (i = 0; i < 8; i++)
    {
      if (regmask & 1)
	{
	  if (!(regmask & 2))
	    {
	      as_bad(_("register list `%s' doesn't fit"), str);
	      break;
	    }
	  regmask_d |= 1 << i;
	}
      else if (regmask & 2)
	{
	  as_bad(_("register list `%s' doesn't fit"), str);
	  break;
	}

      regmask >>= 2;
    }

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regmask_d;
}

static void
parse_pico_in(const struct avr32_operand *op ATTRIBUTE_UNUSED,
	      char *str, int opindex ATTRIBUTE_UNUSED)
{
  unsigned long regid;
  int slot;

  regid = strtoul(str + 2, NULL, 10);

  if (regid >= 12)
    as_bad(_("invalid PiCo IN register `%s'"), str);

  slot = current_insn.next_slot++;
  current_insn.field_value[slot].value = regid;
  current_insn.field_value[slot].align_order = 0;
}

#define parse_pico_out0		parse_nothing
#define parse_pico_out1		parse_nothing
#define parse_pico_out2		parse_nothing
#define parse_pico_out3		parse_nothing

#define OP(name, sgn, pcrel, align, func) \
  { AVR32_OPERAND_##name, sgn, pcrel, align, match_##func, parse_##func }

struct avr32_operand avr32_operand_table[] = {
  OP(INTREG, 0, 0, 0, intreg),
  OP(INTREG_PREDEC, 0, 0, 0, intreg_predec),
  OP(INTREG_POSTINC, 0, 0, 0, intreg_postinc),
  OP(INTREG_LSL, 0, 0, 0, intreg_lsl),
  OP(INTREG_LSR, 0, 0, 0, intreg_lsr),
  OP(INTREG_BSEL, 0, 0, 0, intreg_part),
  OP(INTREG_HSEL, 0, 0, 1, intreg_part),
  OP(INTREG_SDISP, 1, 0, 0, intreg_disp),
  OP(INTREG_SDISP_H, 1, 0, 1, intreg_disp),
  OP(INTREG_SDISP_W, 1, 0, 2, intreg_disp),
  OP(INTREG_UDISP, 0, 0, 0, intreg_disp),
  OP(INTREG_UDISP_H, 0, 0, 1, intreg_disp),
  OP(INTREG_UDISP_W, 0, 0, 2, intreg_disp),
  OP(INTREG_INDEX, 0, 0, 0, intreg_index),
  OP(INTREG_XINDEX, 0, 0, 0, intreg_xindex),
  OP(DWREG, 0, 0, 1, intreg),
  OP(PC_UDISP_W, 0, 1, 2, pc_disp),
  OP(SP, 0, 0, 0, sp),
  OP(SP_UDISP_W, 0, 0, 2, sp_disp),
  OP(CPNO, 0, 0, 0, cpno),
  OP(CPREG, 0, 0, 0, cpreg),
  OP(CPREG_D, 0, 0, 1, cpreg),
  OP(UNSIGNED_CONST, 0, 0, 0, const),
  OP(UNSIGNED_CONST_W, 0, 0, 2, const),
  OP(SIGNED_CONST, 1, 0, 0, const),
  OP(SIGNED_CONST_W, 1, 0, 2, const),
  OP(JMPLABEL, 1, 1, 1, jmplabel),
  OP(UNSIGNED_NUMBER, 0, 0, 0, number),
  OP(UNSIGNED_NUMBER_W, 0, 0, 2, number),
  OP(REGLIST8, 0, 0, 0, reglist8),
  OP(REGLIST9, 0, 0, 0, reglist9),
  OP(REGLIST16, 0, 0, 0, reglist16),
  OP(REGLIST_LDM, 0, 0, 0, reglist_ldm),
  OP(REGLIST_CP8, 0, 0, 0, reglist_cp8),
  OP(REGLIST_CPD8, 0, 0, 0, reglist_cpd8),
  OP(RETVAL, 0, 0, 0, retval),
  OP(MCALL, 1, 0, 2, mcall),
  OP(JOSPINC, 0, 0, 0, jospinc),
  OP(COH, 0, 0, 0, coh),
  OP(PICO_REG_W, 0, 0, 0, picoreg),
  OP(PICO_REG_D, 0, 0, 1, picoreg),
  OP(PICO_REGLIST_W, 0, 0, 0, pico_reglist_w),
  OP(PICO_REGLIST_D, 0, 0, 0, pico_reglist_d),
  OP(PICO_IN, 0, 0, 0, pico_in),
  OP(PICO_OUT0, 0, 0, 0, pico_out0),
  OP(PICO_OUT1, 0, 0, 0, pico_out1),
  OP(PICO_OUT2, 0, 0, 0, pico_out2),
  OP(PICO_OUT3, 0, 0, 0, pico_out3),
};

symbolS *
md_undefined_symbol (char *name ATTRIBUTE_UNUSED)
{
  pr_debug("md_undefined_symbol: %s\n", name);
  return 0;
}

struct avr32_relax_type
{
  long lower_bound;
  long upper_bound;
  unsigned char align;
  unsigned char length;
  signed short next;
};

#define EMPTY { 0, 0, 0, 0, -1 }
#define C(lower, upper, align, next)			\
  { (lower), (upper), (align), 2, AVR32_OPC_##next }
#define E(lower, upper, align)				\
  { (lower), (upper), (align), 4, -1 }

static const struct avr32_relax_type avr32_relax_table[] =
  {
    /* 0 */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY,
    E(0, 65535, 0), E(0, 65535, 0), E(0, 65535, 0), E(0, 65535, 0),
    EMPTY,
    /* 16 */
    EMPTY, EMPTY, EMPTY, EMPTY,

    C(-256, 254, 1, BREQ2), C(-256, 254, 1, BRNE2),
    C(-256, 254, 1, BRCC2), C(-256, 254, 1, BRCS2),
    C(-256, 254, 1, BRGE2), C(-256, 254, 1, BRLT2),
    C(-256, 254, 1, BRMI2), C(-256, 254, 1, BRPL2),
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),
    /* 32 */
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),
    E(-2097152, 2097150, 1), E(-2097152, 2097150, 1),

    EMPTY, EMPTY, EMPTY, EMPTY,
    /* 48 */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY,

