fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
    C(-32, 31, 0, CP_W3), E(-1048576, 1048575, 0),

    EMPTY, EMPTY, EMPTY,
    /* 64: csrfcz */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    E(0, 65535, 0), E(0, 65535, 0),
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    E(-32768, 32767, 0),
    /* 80: LD_SB2 */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,

    C(0, 7, 0, LD_UB4), E(-32768, 32767, 0),

    EMPTY,
    EMPTY, EMPTY,

    C(0, 14, 1, LD_SH4), E(-32768, 32767, 0),

    EMPTY, EMPTY, EMPTY,

    C(0, 14, 1, LD_UH4),

    /* 96: LD_UH4 */
    E(-32768, 32767, 0),

    EMPTY, EMPTY, EMPTY, EMPTY,

    C(0, 124, 2, LD_W4), E(-32768, 32767, 0),

    E(0, 1020, 2),	/* LDC_D1 */
    EMPTY, EMPTY,
    E(0, 1020, 2),	/* LDC_W1 */
    EMPTY, EMPTY,
    E(0, 16380, 2),	/* LDC0_D */
    E(0, 16380, 2),	/* LDC0_W */
    EMPTY,

    /* 112: LDCM_D_PU */
    EMPTY, EMPTY, EMPTY,

    C(0, 508, 2, LDDPC_EXT), E(-32768, 32767, 0),

    EMPTY,EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,

    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 134: MACHH_W */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    E(-131072, 131068, 2),	/* MCALL */
    E(0, 1020, 2),		/* MFDR */
    E(0, 1020, 2),		/* MFSR */
    EMPTY, EMPTY,

    C(-128, 127, 0, MOV2), E(-1048576, 1048575, 0),

    EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,

    E(-128, 127, 0),		/* MOVEQ2 */
    E(-128, 127, 0),		/* MOVNE2 */
    E(-128, 127, 0),		/* MOVCC2 */
    E(-128, 127, 0),		/* 166: MOVCS2 */
    E(-128, 127, 0),		/* MOVGE2 */
    E(-128, 127, 0),		/* MOVLT2 */
    E(-128, 127, 0),		/* MOVMI2 */
    E(-128, 127, 0),		/* MOVPL2 */
    E(-128, 127, 0),		/* MOVLS2 */
    E(-128, 127, 0),		/* MOVGT2 */
    E(-128, 127, 0),		/* MOVLE2 */
    E(-128, 127, 0),		/* MOVHI2 */
    E(-128, 127, 0),		/* MOVVS2 */
    E(-128, 127, 0),		/* MOVVC2 */
    E(-128, 127, 0),		/* MOVQS2 */
    E(-128, 127, 0),		/* MOVAL2 */

    E(0, 1020, 2),		/* MTDR */
    E(0, 1020, 2),		/* MTSR */
    EMPTY,
    EMPTY,
    E(-128, 127, 0),		/* MUL3 */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 198: MVCR_W */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    E(0, 65535, 0), E(0, 65535, 0),
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 230: PASR_H */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 262: PUNPCKSB_H */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,

    C(-1024, 1022, 1, RCALL2), E(-2097152, 2097150, 1),

    EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY,

    C(-1024, 1022, 1, BRAL),

    EMPTY, EMPTY, EMPTY,
    E(-128, 127, 0),		/* RSUB2 */
    /* 294: SATADD_H */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    E(0, 255, 0),		/* SLEEP */
    EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 326: ST_B2 */
    EMPTY, EMPTY,
    C(0, 7, 0, ST_B4), E(-32768, 32767, 0),
    EMPTY, EMPTY, EMPTY, EMPTY,
    E(-32768, 32767, 0),
    EMPTY, EMPTY, EMPTY,
    C(0, 14, 1, ST_H4), E(-32768, 32767, 0),
    EMPTY, EMPTY,
    EMPTY,
    C(0, 60, 2, ST_W4), E(-32768, 32767, 0),
    E(0, 1020, 2),	/* STC_D1 */
    EMPTY, EMPTY,
    E(0, 1020, 2),	/* STC_W1 */
    EMPTY, EMPTY,
    E(0, 16380, 2),	/* STC0_D */
    E(0, 16380, 2),	/* STC0_W */

    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 358: STDSP */
    EMPTY, EMPTY,
    E(0, 1020, 2),	/* STHH_W1 */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY,
    E(-32768, 32767, 0),
    C(-512, 508, 2, SUB4),
    C(-128, 127, 0, SUB4), E(-1048576, 1048576, 0),
    /* SUB{cond} */
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    /* SUBF{cond} */
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    EMPTY,

    /* 406: SWAP_B */
    EMPTY, EMPTY, EMPTY,
    E(0, 255, 0),	/* SYNC */
    EMPTY, EMPTY, EMPTY, EMPTY,
    /* 414: TST */
    EMPTY, EMPTY, E(-65536, 65535, 2), E(-65536, 65535, 2), E(-65536, 65535, 2), EMPTY, EMPTY, EMPTY,
    /* 422: RSUB{cond} */
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0), E(-128, 127, 0),
    /* 436: ADD{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 454: SUB{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 472: AND{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 486: OR{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 502: EOR{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 518: LD.w{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 534: LD.sh{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 550: LD.uh{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 566: LD.sb{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 582: LD.ub{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 596: ST.w{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 614: ST.h{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 630: ST.b{cond} */
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
    /* 646: movh */
    E(0, 65535, 0), EMPTY, EMPTY,
  /* 649: fmac.s */
  EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
  EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY, EMPTY,
  };

#undef E
#undef C
#undef EMPTY

#define AVR32_RS_NONE (-1)

#define avr32_rs_size(state) (avr32_relax_table[(state)].length)
#define avr32_rs_align(state) (avr32_relax_table[(state)].align)
#define relax_more(state) (avr32_relax_table[(state)].next)

#define opc_initial_substate(opc) ((opc)->id)

static int need_relax(int subtype, offsetT distance)
{
  offsetT upper_bound, lower_bound;

  upper_bound = avr32_relax_table[subtype].upper_bound;
  lower_bound = avr32_relax_table[subtype].lower_bound;

