fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  if (distance & ((1 << avr32_rs_align(subtype)) - 1))
    return 1;
  if ((distance > upper_bound) || (distance < lower_bound))
    return 1;

  return 0;
}

enum {
  LDA_SUBTYPE_MOV1,
  LDA_SUBTYPE_MOV2,
  LDA_SUBTYPE_SUB,
  LDA_SUBTYPE_LDDPC,
  LDA_SUBTYPE_LDW,
  LDA_SUBTYPE_GOTLOAD,
  LDA_SUBTYPE_GOTLOAD_LARGE,
};

enum {
  CALL_SUBTYPE_RCALL1,
  CALL_SUBTYPE_RCALL2,
  CALL_SUBTYPE_MCALL_CP,
  CALL_SUBTYPE_MCALL_GOT,
  CALL_SUBTYPE_MCALL_LARGE,
};

#define LDA_INITIAL_SIZE	(avr32_pic ? 4 : 2)
#define CALL_INITIAL_SIZE	2

#define need_reloc(sym, seg, pcrel)					\
  (!(S_IS_DEFINED(sym)							\
     && ((pcrel && S_GET_SEGMENT(sym) == seg)				\
	 || (!pcrel && S_GET_SEGMENT(sym) == absolute_section)))	\
   || S_FORCE_RELOC(sym, 1))

/* Return an initial guess of the length by which a fragment must grow to
   hold a branch to reach its destination.
   Also updates fr_type/fr_subtype as necessary.

   Called just before doing relaxation.
   Any symbol that is now undefined will not become defined.
   The guess for fr_var is ACTUALLY the growth beyond fr_fix.
   Whatever we do to grow fr_fix or fr_var contributes to our returned value.
   Although it may not be explicit in the frag, pretend fr_var starts with a
   0 value.  */

static int
avr32_default_estimate_size_before_relax (fragS *fragP, segT segment)
{
  int growth = 0;

  assert(fragP);
  assert(fragP->fr_symbol);

  if (fragP->tc_frag_data.force_extended
      || need_reloc(fragP->fr_symbol, segment, fragP->tc_frag_data.pcrel))
    {
      int largest_state = fragP->fr_subtype;
      while (relax_more(largest_state) != AVR32_RS_NONE)
	largest_state = relax_more(largest_state);
      growth = avr32_rs_size(largest_state) - fragP->fr_var;
    }
  else
    {
      growth = avr32_rs_size(fragP->fr_subtype) - fragP->fr_var;
    }

  pr_debug("%s:%d: md_estimate_size_before_relax: %d\n",
	   fragP->fr_file, fragP->fr_line, growth);

  return growth;
}

static int
avr32_lda_estimate_size_before_relax(fragS *fragP, segT segment ATTRIBUTE_UNUSED)
{
  return fragP->fr_var - LDA_INITIAL_SIZE;
}

static int
avr32_call_estimate_size_before_relax(fragS *fragP, segT segment ATTRIBUTE_UNUSED)
{
  return fragP->fr_var - CALL_INITIAL_SIZE;
}

static int
avr32_cpool_estimate_size_before_relax(fragS *fragP,
				       segT segment ATTRIBUTE_UNUSED)
{
  return fragP->fr_var;
}

/* This macro may be defined to relax a frag. GAS will call this with the
 * segment, the frag, and the change in size of all previous frags;
 * md_relax_frag should return the change in size of the frag. */
static long
avr32_default_relax_frag (segT segment, fragS *fragP, long stretch)
{
  int state, next_state;
  symbolS *symbolP;	/* The target symbol */
  long growth = 0;

  state = next_state = fragP->fr_subtype;

  symbolP = fragP->fr_symbol;

  if (fragP->tc_frag_data.force_extended
      || need_reloc(symbolP, segment, fragP->tc_frag_data.pcrel))
    {
      /* Symbol must be resolved by the linker. Emit the largest
	 possible opcode. */
      while (relax_more(next_state) != AVR32_RS_NONE)
	next_state = relax_more(next_state);
    }
  else
    {
      addressT address;	/* The address of fragP */
      addressT target;	/* The address of the target symbol */
      offsetT distance;	/* The distance between the insn and the symbol */
      fragS *sym_frag;

      address = fragP->fr_address;
      target = fragP->fr_offset;
      symbolP = fragP->fr_symbol;
      sym_frag = symbol_get_frag(symbolP);

      address += fragP->fr_fix - fragP->fr_var;
      target += S_GET_VALUE(symbolP);

      if (stretch != 0
	  && sym_frag->relax_marker != fragP->relax_marker
	  && S_GET_SEGMENT(symbolP) == segment)
	/* if it was correctly aligned before, make sure it stays aligned */
	target += stretch & (~0UL << avr32_rs_align(state));

      if (fragP->tc_frag_data.pcrel)
	distance = target - (address & (~0UL << avr32_rs_align(state)));
      else
	distance = target;

      pr_debug("%s:%d: relax more? 0x%x - 0x%x = 0x%x (%d), align %d\n",
	       fragP->fr_file, fragP->fr_line, target, address,
	       distance, distance, avr32_rs_align(state));

      if (need_relax(state, distance))
	{
	  if (relax_more(state) != AVR32_RS_NONE)
	    next_state = relax_more(state);
	  pr_debug("%s:%d: relax more %d -> %d (%d - %d, align %d)\n",
		   fragP->fr_file, fragP->fr_line, state, next_state,
		   target, address, avr32_rs_align(state));
	}
    }

  growth = avr32_rs_size(next_state) - avr32_rs_size(state);
  fragP->fr_subtype = next_state;

  pr_debug("%s:%d: md_relax_frag: growth=%d, subtype=%d, opc=0x%08lx\n",
	   fragP->fr_file, fragP->fr_line, growth, fragP->fr_subtype,
	   avr32_opc_table[next_state].value);

  return growth;
}

static long
avr32_lda_relax_frag(segT segment, fragS *fragP, long stretch)
{
  struct cpool *pool= NULL;
  unsigned int entry = 0;
  addressT address, target;
  offsetT distance;
  symbolS *symbolP;
  fragS *sym_frag;
  long old_size, new_size;

  symbolP = fragP->fr_symbol;
  old_size = fragP->fr_var;
  if (!avr32_pic)
    {
      pool = fragP->tc_frag_data.pool;
      entry = fragP->tc_frag_data.pool_entry;
    }

  address = fragP->fr_address;
  address += fragP->fr_fix - LDA_INITIAL_SIZE;

  if (!S_IS_DEFINED(symbolP) || S_FORCE_RELOC(symbolP, 1))
    goto relax_max;

  target = fragP->fr_offset;
  sym_frag = symbol_get_frag(symbolP);
  target += S_GET_VALUE(symbolP);

  if (sym_frag->relax_marker != fragP->relax_marker
      && S_GET_SEGMENT(symbolP) == segment)
    target += stretch;

  distance = target - address;

  pr_debug("lda_relax_frag: target: %d, address: %d, var: %d\n",
	   target, address, fragP->fr_var);

  if (!avr32_pic && S_GET_SEGMENT(symbolP) == absolute_section
      && target <= 127 && (offsetT)target >= -128)
    {
      if (fragP->fr_subtype == LDA_SUBTYPE_LDDPC
	  || fragP->fr_subtype == LDA_SUBTYPE_LDW)
	pool->literals[entry].refcount--;
      new_size = 2;
      fragP->fr_subtype = LDA_SUBTYPE_MOV1;
    }
  else if (!avr32_pic && S_GET_SEGMENT(symbolP) == absolute_section
	   && target <= 1048575 && (offsetT)target >= -1048576)
    {
      if (fragP->fr_subtype == LDA_SUBTYPE_LDDPC
	  || fragP->fr_subtype == LDA_SUBTYPE_LDW)
	pool->literals[entry].refcount--;
      new_size = 4;
      fragP->fr_subtype = LDA_SUBTYPE_MOV2;
    }
  else if (!linkrelax && S_GET_SEGMENT(symbolP) == segment
	   /* the field will be negated, so this is really -(-32768)
	      and -(32767) */
	   && distance <= 32768 && distance >= -32767)
    {
      if (!avr32_pic
	  && (fragP->fr_subtype == LDA_SUBTYPE_LDDPC
	      || fragP->fr_subtype == LDA_SUBTYPE_LDW))
	pool->literals[entry].refcount--;
      new_size = 4;
      fragP->fr_subtype = LDA_SUBTYPE_SUB;
    }
  else
    {
    relax_max:
      if (avr32_pic)
	{
	  if (linkrelax)
	    {
	      new_size = 8;
	      fragP->fr_subtype = LDA_SUBTYPE_GOTLOAD_LARGE;
	    }
	  else
	    {
	      new_size = 4;
	      fragP->fr_subtype = LDA_SUBTYPE_GOTLOAD;
	    }
	}
      else
	{
	  if (fragP->fr_subtype != LDA_SUBTYPE_LDDPC
	      && fragP->fr_subtype != LDA_SUBTYPE_LDW)
	    pool->literals[entry].refcount++;

