fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
	  sym_frag = symbol_get_frag(pool->symbol);
	  target = (sym_frag->fr_address + sym_frag->fr_fix
		    + pool->padding + pool->literals[entry].offset);

	  pr_debug("cpool sym address: 0x%lx\n",
		   sym_frag->fr_address + sym_frag->fr_fix);

	  know(pool->section == segment);

	  if (sym_frag->relax_marker != fragP->relax_marker)
	    target += stretch;

	  distance = target - address;
	  if (distance <= 508 && distance >= 0)
	    {
	      new_size = 2;
	      fragP->fr_subtype = LDA_SUBTYPE_LDDPC;
	    }
	  else
	    {
	      new_size = 4;
	      fragP->fr_subtype = LDA_SUBTYPE_LDW;
	    }

	  pr_debug("lda_relax_frag (cpool): target=0x%lx, address=0x%lx, refcount=%d\n",
		   target, address, pool->literals[entry].refcount);
	}
    }

  fragP->fr_var = new_size;

  pr_debug("%s:%d: lda: relax pass done. subtype: %d, growth: %ld\n",
	   fragP->fr_file, fragP->fr_line,
	   fragP->fr_subtype, new_size - old_size);

  return new_size - old_size;
}

static long
avr32_call_relax_frag(segT segment, fragS *fragP, long stretch)
{
  struct cpool *pool = NULL;
  unsigned int entry = 0;
  addressT address, target;
  offsetT distance;
  symbolS *symbolP;
  fragS *sym_frag;
  long old_size, new_size;

  symbolP = fragP->fr_symbol;
  old_size = fragP->fr_var;
  if (!avr32_pic)
    {
      pool = fragP->tc_frag_data.pool;
      entry = fragP->tc_frag_data.pool_entry;
    }

  address = fragP->fr_address;
  address += fragP->fr_fix - CALL_INITIAL_SIZE;

  if (need_reloc(symbolP, segment, 1))
    {
      pr_debug("call: must emit reloc\n");
      goto relax_max;
    }

  target = fragP->fr_offset;
  sym_frag = symbol_get_frag(symbolP);
  target += S_GET_VALUE(symbolP);

  if (sym_frag->relax_marker != fragP->relax_marker
      && S_GET_SEGMENT(symbolP) == segment)
    target += stretch;

  distance = target - address;

  if (distance <= 1022 && distance >= -1024)
    {
      pr_debug("call: distance is %d, emitting short rcall\n", distance);
      if (!avr32_pic && fragP->fr_subtype == CALL_SUBTYPE_MCALL_CP)
	pool->literals[entry].refcount--;
      new_size = 2;
      fragP->fr_subtype = CALL_SUBTYPE_RCALL1;
    }
  else if (distance <= 2097150 && distance >= -2097152)
    {
      pr_debug("call: distance is %d, emitting long rcall\n", distance);
      if (!avr32_pic && fragP->fr_subtype == CALL_SUBTYPE_MCALL_CP)
	pool->literals[entry].refcount--;
      new_size = 4;
      fragP->fr_subtype = CALL_SUBTYPE_RCALL2;
    }
  else
    {
      pr_debug("call: distance %d too far, emitting something big\n", distance);

    relax_max:
      if (avr32_pic)
	{
	  if (linkrelax)
	    {
	      new_size = 10;
	      fragP->fr_subtype = CALL_SUBTYPE_MCALL_LARGE;
	    }
	  else
	    {
	      new_size = 4;
	      fragP->fr_subtype = CALL_SUBTYPE_MCALL_GOT;
	    }
	}
      else
	{
	  if (fragP->fr_subtype != CALL_SUBTYPE_MCALL_CP)
	    pool->literals[entry].refcount++;

	  new_size = 4;
	  fragP->fr_subtype = CALL_SUBTYPE_MCALL_CP;
	}
    }

  fragP->fr_var = new_size;

  pr_debug("%s:%d: call: relax pass done, growth: %d, fr_var: %d\n",
	   fragP->fr_file, fragP->fr_line,
	   new_size - old_size, fragP->fr_var);

  return new_size - old_size;
}

static long
avr32_cpool_relax_frag(segT segment ATTRIBUTE_UNUSED,
		       fragS *fragP,
		       long stretch ATTRIBUTE_UNUSED)
{
  struct cpool *pool;
  addressT address;
  long old_size, new_size;
  unsigned int entry;

  pool = fragP->tc_frag_data.pool;
  address = fragP->fr_address + fragP->fr_fix;
  old_size = fragP->fr_var;
  new_size = 0;

  for (entry = 0; entry < pool->next_free_entry; entry++)
    {
      if (pool->literals[entry].refcount > 0)
	{
	  pool->literals[entry].offset = new_size;
	  new_size += 4;
	}
    }

  fragP->fr_var = new_size;

  return new_size - old_size;
}

/* *fragP has been relaxed to its final size, and now needs to have
   the bytes inside it modified to conform to the new size.

   Called after relaxation is finished.
   fragP->fr_type == rs_machine_dependent.
   fragP->fr_subtype is the subtype of what the address relaxed to.  */

static void
avr32_default_convert_frag (bfd *abfd ATTRIBUTE_UNUSED,
			    segT segment ATTRIBUTE_UNUSED,
			    fragS *fragP)
{
  const struct avr32_opcode *opc;
  const struct avr32_ifield *ifield;
  bfd_reloc_code_real_type r_type;
  symbolS *symbolP;
  fixS *fixP;
  bfd_vma value;
  int subtype;

  opc = &avr32_opc_table[fragP->fr_subtype];
  ifield = opc->fields[opc->var_field];
  symbolP = fragP->fr_symbol;
  subtype = fragP->fr_subtype;
  r_type = opc->reloc_type;

  /* Clear the opcode bits and the bits belonging to the relaxed
     field.  We assume all other fields stay the same.  */
  value = bfd_getb32(fragP->fr_opcode);
  value &= ~(opc->mask | ifield->mask);

  /* Insert the new opcode */
  value |= opc->value;
  bfd_putb32(value, fragP->fr_opcode);

  fragP->fr_fix += opc->size - fragP->fr_var;

  if (fragP->tc_frag_data.reloc_info != AVR32_OPINFO_NONE)
    {
      switch (fragP->tc_frag_data.reloc_info)
	{
	case AVR32_OPINFO_HI:
	  r_type = BFD_RELOC_HI16;
	  break;
	case AVR32_OPINFO_LO:
	  r_type = BFD_RELOC_LO16;
	  break;
	case AVR32_OPINFO_GOT:
	  switch (r_type)
	    {
	    case BFD_RELOC_AVR32_18W_PCREL:
	      r_type = BFD_RELOC_AVR32_GOT18SW;
	      break;
	    case BFD_RELOC_AVR32_16S:
	      r_type = BFD_RELOC_AVR32_GOT16S;
	      break;
	    default:
	      BAD_CASE(r_type);
	      break;
	    }
	  break;
	default:
	  BAD_CASE(fragP->tc_frag_data.reloc_info);
	  break;
	}
    }

  pr_debug("%s:%d: convert_frag: new %s fixup\n",
	   fragP->fr_file, fragP->fr_line,
	   bfd_get_reloc_code_name(r_type));

#if 1
  fixP = fix_new_exp(fragP, fragP->fr_fix - opc->size, opc->size,
		     &fragP->tc_frag_data.exp,
		     fragP->tc_frag_data.pcrel, r_type);
#else
  fixP = fix_new(fragP, fragP->fr_fix - opc->size, opc->size, symbolP,
		 fragP->fr_offset, fragP->tc_frag_data.pcrel, r_type);
#endif

  /* Revert fix_new brain damage. "dot_value" is the value of PC at
     the point of the fixup, relative to the frag address.  fix_new()
     and friends think they are only being called during the assembly
     pass, not during relaxation or similar, so fx_dot_value, fx_file
     and fx_line are all initialized to the wrong value.  But we don't
     know the size of the fixup until now, so we really can't live up
     to the assumptions these functions make about the target.  What
     do these functions think the "where" and "frag" argument mean
     anyway?  */
  fixP->fx_dot_value = fragP->fr_fix - opc->size;
  fixP->fx_file = fragP->fr_file;
  fixP->fx_line = fragP->fr_line;

  fixP->tc_fix_data.ifield = ifield;
  fixP->tc_fix_data.align = avr32_rs_align(subtype);
  fixP->tc_fix_data.min = avr32_relax_table[subtype].lower_bound;
  fixP->tc_fix_data.max = avr32_relax_table[subtype].upper_bound;
}

static void
avr32_lda_convert_frag(bfd *abfd ATTRIBUTE_UNUSED,
		       segT segment ATTRIBUTE_UNUSED,
		       fragS *fragP)
{
  const struct avr32_opcode *opc;
  const struct avr32_ifield *ifield;
  bfd_reloc_code_real_type r_type;
  expressionS exp;
  struct cpool *pool;
  fixS *fixP;
  bfd_vma value;
  int regid, pcrel = 0, align = 0;
  char *p;

