fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  r_type = BFD_RELOC_NONE;
  regid = fragP->tc_frag_data.reloc_info;
  p = fragP->fr_opcode;
  exp.X_add_symbol = fragP->fr_symbol;
  exp.X_add_number = fragP->fr_offset;
  exp.X_op = O_symbol;

  pr_debug("%s:%d: lda_convert_frag, subtype: %d, fix: %d, var: %d, regid: %d\n",
	   fragP->fr_file, fragP->fr_line,
	   fragP->fr_subtype, fragP->fr_fix, fragP->fr_var, regid);

  switch (fragP->fr_subtype)
    {
    case LDA_SUBTYPE_MOV1:
      opc = &avr32_opc_table[AVR32_OPC_MOV1];
      opc->fields[0]->insert(opc->fields[0], p, regid);
      ifield = opc->fields[1];
      r_type = opc->reloc_type;
      break;
    case LDA_SUBTYPE_MOV2:
      opc = &avr32_opc_table[AVR32_OPC_MOV2];
      opc->fields[0]->insert(opc->fields[0], p, regid);
      ifield = opc->fields[1];
      r_type = opc->reloc_type;
      break;
    case LDA_SUBTYPE_SUB:
      opc = &avr32_opc_table[AVR32_OPC_SUB5];
      opc->fields[0]->insert(opc->fields[0], p, regid);
      opc->fields[1]->insert(opc->fields[1], p, AVR32_REG_PC);
      ifield = opc->fields[2];
      r_type = BFD_RELOC_AVR32_16N_PCREL;

      /* Pretend that SUB5 isn't a "negated" pcrel expression for now.
	 We'll have to fix it up later when we know whether to
	 generate a reloc for it (in which case the linker will negate
	 it, so we shouldn't). */
      pcrel = 1;
      break;
    case LDA_SUBTYPE_LDDPC:
      opc = &avr32_opc_table[AVR32_OPC_LDDPC];
      align = 2;
      r_type = BFD_RELOC_AVR32_9W_CP;
      goto cpool_common;
    case LDA_SUBTYPE_LDW:
      opc = &avr32_opc_table[AVR32_OPC_LDDPC_EXT];
      r_type = BFD_RELOC_AVR32_16_CP;
    cpool_common:
      opc->fields[0]->insert(opc->fields[0], p, regid);
      ifield = opc->fields[1];
      pool = fragP->tc_frag_data.pool;
      exp.X_add_symbol = pool->symbol;
      exp.X_add_number = pool->literals[fragP->tc_frag_data.pool_entry].offset;
      pcrel = 1;
      break;
    case LDA_SUBTYPE_GOTLOAD_LARGE:
      /* ld.w Rd, r6[Rd << 2] (last) */
      opc = &avr32_opc_table[AVR32_OPC_LD_W5];
      bfd_putb32(opc->value, p + 4);
      opc->fields[0]->insert(opc->fields[0], p + 4, regid);
      opc->fields[1]->insert(opc->fields[1], p + 4, 6);
      opc->fields[2]->insert(opc->fields[2], p + 4, regid);
      opc->fields[3]->insert(opc->fields[3], p + 4, 2);

      /* mov Rd, (got_offset / 4) */
      opc = &avr32_opc_table[AVR32_OPC_MOV2];
      opc->fields[0]->insert(opc->fields[0], p, regid);
      ifield = opc->fields[1];
      r_type = BFD_RELOC_AVR32_LDA_GOT;
      break;
    case LDA_SUBTYPE_GOTLOAD:
      opc = &avr32_opc_table[AVR32_OPC_LD_W4];
      opc->fields[0]->insert(opc->fields[0], p, regid);
      opc->fields[1]->insert(opc->fields[1], p, 6);
      ifield = opc->fields[2];
      if (r_type == BFD_RELOC_NONE)
	r_type = BFD_RELOC_AVR32_GOT16S;
      break;
    default:
      BAD_CASE(fragP->fr_subtype);
    }

  value = bfd_getb32(p);
  value &= ~(opc->mask | ifield->mask);
  value |= opc->value;
  bfd_putb32(value, p);

  fragP->fr_fix += fragP->fr_var - LDA_INITIAL_SIZE;

  if (fragP->fr_next
      && ((offsetT)(fragP->fr_next->fr_address - fragP->fr_address)
	  != fragP->fr_fix))
    {
      fprintf(stderr, "LDA frag: fr_fix is wrong! fragP->fr_var = %ld, r_type = %s\n",
	      fragP->fr_var, bfd_get_reloc_code_name(r_type));
      abort();
    }

  fixP = fix_new_exp(fragP, fragP->fr_fix - fragP->fr_var, fragP->fr_var,
		     &exp, pcrel, r_type);

  /* Revert fix_new brain damage. "dot_value" is the value of PC at
     the point of the fixup, relative to the frag address.  fix_new()
     and friends think they are only being called during the assembly
     pass, not during relaxation or similar, so fx_dot_value, fx_file
     and fx_line are all initialized to the wrong value.  But we don't
     know the size of the fixup until now, so we really can't live up
     to the assumptions these functions make about the target.  What
     do these functions think the "where" and "frag" argument mean
     anyway?  */
  fixP->fx_dot_value = fragP->fr_fix - opc->size;
  fixP->fx_file = fragP->fr_file;
  fixP->fx_line = fragP->fr_line;

  fixP->tc_fix_data.ifield = ifield;
  fixP->tc_fix_data.align = align;
  /* these are only used if the fixup can actually be resolved */
  fixP->tc_fix_data.min = -32768;
  fixP->tc_fix_data.max = 32767;
}

static void
avr32_call_convert_frag(bfd *abfd ATTRIBUTE_UNUSED,
		       segT segment ATTRIBUTE_UNUSED,
		       fragS *fragP)
{
  const struct avr32_opcode *opc = NULL;
  const struct avr32_ifield *ifield;
  bfd_reloc_code_real_type r_type;
  symbolS *symbol;
  offsetT offset;
  fixS *fixP;
  bfd_vma value;
  int pcrel = 0, align = 0;
  char *p;

  symbol = fragP->fr_symbol;
  offset = fragP->fr_offset;
  r_type = BFD_RELOC_NONE;
  p = fragP->fr_opcode;

  pr_debug("%s:%d: call_convert_frag, subtype: %d, fix: %d, var: %d\n",
	   fragP->fr_file, fragP->fr_line,
	   fragP->fr_subtype, fragP->fr_fix, fragP->fr_var);

  switch (fragP->fr_subtype)
    {
    case CALL_SUBTYPE_RCALL1:
      opc = &avr32_opc_table[AVR32_OPC_RCALL1];
      /* fall through */
    case CALL_SUBTYPE_RCALL2:
      if (!opc)
	opc = &avr32_opc_table[AVR32_OPC_RCALL2];
      ifield = opc->fields[0];
      r_type = opc->reloc_type;
      pcrel = 1;
      align = 1;
      break;
    case CALL_SUBTYPE_MCALL_CP:
      opc = &avr32_opc_table[AVR32_OPC_MCALL];
      opc->fields[0]->insert(opc->fields[0], p, AVR32_REG_PC);
      ifield = opc->fields[1];
      r_type = BFD_RELOC_AVR32_CPCALL;
      symbol = fragP->tc_frag_data.pool->symbol;
      offset = fragP->tc_frag_data.pool->literals[fragP->tc_frag_data.pool_entry].offset;
      assert(fragP->tc_frag_data.pool->literals[fragP->tc_frag_data.pool_entry].refcount > 0);
      pcrel = 1;
      align = 2;
      break;
    case CALL_SUBTYPE_MCALL_GOT:
      opc = &avr32_opc_table[AVR32_OPC_MCALL];
      opc->fields[0]->insert(opc->fields[0], p, 6);
      ifield = opc->fields[1];
      r_type = BFD_RELOC_AVR32_GOT18SW;
      break;
    case CALL_SUBTYPE_MCALL_LARGE:
      assert(fragP->fr_var == 10);
      /* ld.w lr, r6[lr << 2] */
      opc = &avr32_opc_table[AVR32_OPC_LD_W5];
      bfd_putb32(opc->value, p + 4);
      opc->fields[0]->insert(opc->fields[0], p + 4, AVR32_REG_LR);
      opc->fields[1]->insert(opc->fields[1], p + 4, 6);
      opc->fields[2]->insert(opc->fields[2], p + 4, AVR32_REG_LR);
      opc->fields[3]->insert(opc->fields[3], p + 4, 2);

      /* icall lr */
      opc = &avr32_opc_table[AVR32_OPC_ICALL];
      bfd_putb16(opc->value >> 16, p + 8);
      opc->fields[0]->insert(opc->fields[0], p + 8, AVR32_REG_LR);

      /* mov lr, (got_offset / 4) */
      opc = &avr32_opc_table[AVR32_OPC_MOV2];
      opc->fields[0]->insert(opc->fields[0], p, AVR32_REG_LR);
      ifield = opc->fields[1];
      r_type = BFD_RELOC_AVR32_GOTCALL;
      break;
    default:
      BAD_CASE(fragP->fr_subtype);
    }

