fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  /* Insert the opcode and clear the variable ifield */
  value = bfd_getb32(p);
  value &= ~(opc->mask | ifield->mask);
  value |= opc->value;
  bfd_putb32(value, p);

  fragP->fr_fix += fragP->fr_var - CALL_INITIAL_SIZE;

  if (fragP->fr_next
      && ((offsetT)(fragP->fr_next->fr_address - fragP->fr_address)
	  != fragP->fr_fix))
    {
      fprintf(stderr, "%s:%d: fr_fix %lu is wrong! fr_var=%lu, r_type=%s\n",
	      fragP->fr_file, fragP->fr_line,
	      fragP->fr_fix, fragP->fr_var, bfd_get_reloc_code_name(r_type));
      fprintf(stderr, "fr_fix should be %ld. next frag is %s:%d\n",
	      (offsetT)(fragP->fr_next->fr_address - fragP->fr_address),
	      fragP->fr_next->fr_file, fragP->fr_next->fr_line);
    }

  fixP = fix_new(fragP, fragP->fr_fix - fragP->fr_var, fragP->fr_var,
		 symbol, offset, pcrel, r_type);

  /* Revert fix_new brain damage. "dot_value" is the value of PC at
     the point of the fixup, relative to the frag address.  fix_new()
     and friends think they are only being called during the assembly
     pass, not during relaxation or similar, so fx_dot_value, fx_file
     and fx_line are all initialized to the wrong value.  But we don't
     know the size of the fixup until now, so we really can't live up
     to the assumptions these functions make about the target.  What
     do these functions think the "where" and "frag" argument mean
     anyway?  */
  fixP->fx_dot_value = fragP->fr_fix - opc->size;
  fixP->fx_file = fragP->fr_file;
  fixP->fx_line = fragP->fr_line;

  fixP->tc_fix_data.ifield = ifield;
  fixP->tc_fix_data.align = align;
  /* these are only used if the fixup can actually be resolved */
  fixP->tc_fix_data.min = -2097152;
  fixP->tc_fix_data.max = 2097150;
}

static void
avr32_cpool_convert_frag(bfd *abfd ATTRIBUTE_UNUSED,
			 segT segment ATTRIBUTE_UNUSED,
			 fragS *fragP)
{
  struct cpool *pool;
  addressT address;
  unsigned int entry;
  char *p;
  char sym_name[20];

  /* Did we get rid of the frag altogether? */
  if (!fragP->fr_var)
    return;

  pool = fragP->tc_frag_data.pool;
  address = fragP->fr_address + fragP->fr_fix;
  p = fragP->fr_literal + fragP->fr_fix;

  sprintf(sym_name, "$$cp_\002%x", pool->id);
  symbol_locate(pool->symbol, sym_name, pool->section, fragP->fr_fix, fragP);
  symbol_table_insert(pool->symbol);

  for (entry = 0; entry < pool->next_free_entry; entry++)
    {
      if (pool->literals[entry].refcount > 0)
	{
	  fix_new_exp(fragP, fragP->fr_fix, 4, &pool->literals[entry].exp,
		      FALSE, BFD_RELOC_AVR32_32_CPENT);
	  fragP->fr_fix += 4;
	}
    }
}

static struct avr32_relaxer avr32_default_relaxer = {
  .estimate_size	= avr32_default_estimate_size_before_relax,
  .relax_frag		= avr32_default_relax_frag,
  .convert_frag		= avr32_default_convert_frag,
};
static struct avr32_relaxer avr32_lda_relaxer = {
  .estimate_size	= avr32_lda_estimate_size_before_relax,
  .relax_frag		= avr32_lda_relax_frag,
  .convert_frag		= avr32_lda_convert_frag,
};
static struct avr32_relaxer avr32_call_relaxer = {
  .estimate_size	= avr32_call_estimate_size_before_relax,
  .relax_frag		= avr32_call_relax_frag,
  .convert_frag		= avr32_call_convert_frag,
};
static struct avr32_relaxer avr32_cpool_relaxer = {
  .estimate_size	= avr32_cpool_estimate_size_before_relax,
  .relax_frag		= avr32_cpool_relax_frag,
  .convert_frag		= avr32_cpool_convert_frag,
};

static void s_cpool(int arg ATTRIBUTE_UNUSED)
{
  struct cpool *pool;
  unsigned int max_size;
  char *buf;

  pool = find_cpool(now_seg, now_subseg);
  if (!pool || !pool->symbol || pool->next_free_entry == 0)
    return;

  /* Make sure the constant pool is properly aligned */
  frag_align_code(2, 0);
  if (bfd_get_section_alignment(stdoutput, pool->section) < 2)
    bfd_set_section_alignment(stdoutput, pool->section, 2);

  /* Assume none of the entries are discarded, and that we need the
     maximum amount of alignment.  But we're not going to allocate
     anything up front. */
  max_size = pool->next_free_entry * 4 + 2;
  frag_grow(max_size);
  buf = frag_more(0);

  frag_now->tc_frag_data.relaxer = &avr32_cpool_relaxer;
  frag_now->tc_frag_data.pool = pool;

  symbol_set_frag(pool->symbol, frag_now);

  /* Assume zero initial size, allowing other relaxers to be
     optimistic about things.  */
  frag_var(rs_machine_dependent, max_size, 0,
	   0, pool->symbol, 0, NULL);

  /* Mark the pool as empty.  */
  pool->used = 1;
}

/* The location from which a PC relative jump should be calculated,
   given a PC relative reloc.  */

long
md_pcrel_from_section (fixS *fixP, segT sec)
{
  pr_debug("pcrel_from_section, fx_offset = %d\n", fixP->fx_offset);

  if (fixP->fx_addsy != NULL
      && (! S_IS_DEFINED (fixP->fx_addsy)
          || S_GET_SEGMENT (fixP->fx_addsy) != sec
	  || S_FORCE_RELOC(fixP->fx_addsy, 1)))
    {
      pr_debug("Unknown pcrel symbol: %s\n", S_GET_NAME(fixP->fx_addsy));

      /* The symbol is undefined (or is defined but not in this section).
	 Let the linker figure it out.  */
      return 0;
    }

  pr_debug("pcrel from %x + %x, symbol: %s (%x)\n",
	   fixP->fx_frag->fr_address, fixP->fx_where,
	   fixP->fx_addsy?S_GET_NAME(fixP->fx_addsy):"(null)",
	   fixP->fx_addsy?S_GET_VALUE(fixP->fx_addsy):0);

  return ((fixP->fx_frag->fr_address + fixP->fx_where)
	  & (~0UL << fixP->tc_fix_data.align));
}

valueT
md_section_align (segT segment, valueT size)
{
  int align = bfd_get_section_alignment (stdoutput, segment);
  return ((size + (1 << align) - 1) & (-1 << align));
}

static int syntax_matches(const struct avr32_syntax *syntax,
			  char *str)
{
  int i;

  pr_debug("syntax %d matches `%s'?\n", syntax->id, str);

  if (syntax->nr_operands < 0)
    {
      struct avr32_operand *op;
      int optype;

      for (i = 0; i < (-syntax->nr_operands - 1); i++)
	{
	  char *p;
	  char c;

	  optype = syntax->operand[i];
	  assert(optype < AVR32_NR_OPERANDS);
	  op = &avr32_operand_table[optype];

	  for (p = str; *p; p++)
	    if (*p == ',')
	      break;

	  if (p == str)
	    return 0;

	  c = *p;
	  *p = 0;

	  if (!op->match(str))
	    {
	      *p = c;
	      return 0;
	    }

	  str = p;
	  *p = c;
	  if (c)
	    str++;
	}

      optype = syntax->operand[i];
      assert(optype < AVR32_NR_OPERANDS);
      op = &avr32_operand_table[optype];

      if (!op->match(str))
	return 0;
      return 1;
    }

