fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  for (i = 0; i < syntax->nr_operands; i++)
    {
      struct avr32_operand *op;
      int optype = syntax->operand[i];
      char *p;
      char c;

      assert(optype < AVR32_NR_OPERANDS);
      op = &avr32_operand_table[optype];

      for (p = str; *p; p++)
	if (*p == ',')
	  break;

      if (p == str)
	return 0;

      c = *p;
      *p = 0;

      if (!op->match(str))
	{
	  *p = c;
	  return 0;
	}

      str = p;
      *p = c;
      if (c)
	str++;
    }

  if (*str == '\0')
    return 1;

  if ((*str == 'e' || *str == 'E') && !str[1])
    return 1;

  return 0;
}

static int parse_operands(char *str)
{
  int i;

  if (current_insn.syntax->nr_operands < 0)
    {
      int optype;
      struct avr32_operand *op;

      for (i = 0; i < (-current_insn.syntax->nr_operands - 1); i++)
	{
	  char *p;
	  char c;

	  optype = current_insn.syntax->operand[i];
	  op = &avr32_operand_table[optype];

	  for (p = str; *p; p++)
	    if (*p == ',')
	      break;

	  assert(p != str);

	  c = *p, *p = 0;
	  op->parse(op, str, i);
	  *p = c;

	  str = p;
	  if (c) str++;
	}

      /* give the rest of the line to the last operand */
      optype = current_insn.syntax->operand[i];
      op = &avr32_operand_table[optype];
      op->parse(op, str, i);
    }
  else
    {
      for (i = 0; i < current_insn.syntax->nr_operands; i++)
	{
	  int optype = current_insn.syntax->operand[i];
	  struct avr32_operand *op = &avr32_operand_table[optype];
	  char *p;
	  char c;

	  skip_whitespace(str);

	  for (p = str; *p; p++)
	    if (*p == ',')
	      break;

	  assert(p != str);

	  c = *p, *p = 0;
	  op->parse(op, str, i);
	  *p = c;

	  str = p;
	  if (c) str++;
	}

      if (*str == 'E' || *str == 'e')
	current_insn.force_extended = 1;
    }

  return 0;
}

static const char *
finish_insn(const struct avr32_opcode *opc)
{
  expressionS *exp = &current_insn.immediate;
  unsigned int i;
  int will_relax = 0;
  char *buf;

  assert(current_insn.next_slot == opc->nr_fields);

  pr_debug("%s:%d: finish_insn: trying opcode %d\n",
	   frag_now->fr_file, frag_now->fr_line, opc->id);

  /* Go through the relaxation stage for all instructions that can
     possibly take a symbolic immediate.  The relax code will take
     care of range checking and alignment.  */
  if (opc->var_field != -1)
    {
      int substate, largest_substate;
      symbolS *sym;
      offsetT off;

      will_relax = 1;
      substate = largest_substate = opc_initial_substate(opc);

      while (relax_more(largest_substate) != AVR32_RS_NONE)
	largest_substate = relax_more(largest_substate);

      pr_debug("will relax. initial substate: %d (size %d), largest substate: %d (size %d)\n",
	       substate, avr32_rs_size(substate),
	       largest_substate, avr32_rs_size(largest_substate));

      /* make sure we have enough room for the largest possible opcode */
      frag_grow(avr32_rs_size(largest_substate));
      buf = frag_more(opc->size);

      dwarf2_emit_insn(opc->size);

      frag_now->tc_frag_data.reloc_info = AVR32_OPINFO_NONE;
      frag_now->tc_frag_data.pcrel = current_insn.pcrel;
      frag_now->tc_frag_data.force_extended = current_insn.force_extended;
      frag_now->tc_frag_data.relaxer = &avr32_default_relaxer;

      if (exp->X_op == O_hi)
	{
	  frag_now->tc_frag_data.reloc_info = AVR32_OPINFO_HI;
	  exp->X_op = exp->X_md;
	}
      else if (exp->X_op == O_lo)
	{
	  frag_now->tc_frag_data.reloc_info = AVR32_OPINFO_LO;
	  exp->X_op = exp->X_md;
	}
      else if (exp->X_op == O_got)
	{
	  frag_now->tc_frag_data.reloc_info = AVR32_OPINFO_GOT;
	  exp->X_op = O_symbol;
	}

#if 0
      if ((opc->reloc_type == BFD_RELOC_AVR32_SUB5)
	  && exp->X_op == O_subtract)
	{
	  symbolS *tmp;
	  tmp = exp->X_add_symbol;
	  exp->X_add_symbol = exp->X_op_symbol;
	  exp->X_op_symbol = tmp;
	}
#endif

      frag_now->tc_frag_data.exp = current_insn.immediate;

      sym = exp->X_add_symbol;
      off = exp->X_add_number;
      if (exp->X_op != O_symbol)
	{
	  sym = make_expr_symbol(exp);
	  off = 0;
	}

      frag_var(rs_machine_dependent,
	       avr32_rs_size(largest_substate) - opc->size,
	       opc->size,
	       substate, sym, off, buf);
    }
  else
    {
      assert(avr32_rs_size(opc_initial_substate(opc)) == 0);

      /* Make sure we always have room for another whole word, as the ifield
	 inserters can only write words. */
      frag_grow(4);
      buf = frag_more(opc->size);
      dwarf2_emit_insn(opc->size);
    }

  assert(!(opc->value & ~opc->mask));

  pr_debug("inserting opcode: 0x%lx\n", opc->value);
  bfd_putb32(opc->value, buf);

  for (i = 0; i < opc->nr_fields; i++)
    {
      const struct avr32_ifield *f = opc->fields[i];
      const struct avr32_ifield_data *fd = &current_insn.field_value[i];

      pr_debug("inserting field: 0x%lx & 0x%lx\n",
	       fd->value >> fd->align_order, f->mask);

      f->insert(f, buf, fd->value >> fd->align_order);
    }

  assert(will_relax || !current_insn.immediate.X_add_symbol);
  return NULL;
}

static const char *
finish_alias(const struct avr32_alias *alias)
{
  const struct avr32_opcode *opc;
  struct {
    unsigned long value;
    unsigned long align;
  } mapped_operand[AVR32_MAX_OPERANDS];
  unsigned int i;

  opc = alias->opc;

  /* Remap the operands from the alias to the real opcode */
  for (i = 0; i < opc->nr_fields; i++)
    {
      if (alias->operand_map[i].is_opindex)
	{
	  struct avr32_ifield_data *fd;
	  fd = &current_insn.field_value[alias->operand_map[i].value];
	  mapped_operand[i].value = fd->value;
	  mapped_operand[i].align = fd->align_order;
	}
      else
	{
	  mapped_operand[i].value = alias->operand_map[i].value;
	  mapped_operand[i].align = 0;
	}
    }

  for (i = 0; i < opc->nr_fields; i++)
    {
      current_insn.field_value[i].value = mapped_operand[i].value;
      if (opc->id == AVR32_OPC_COP)
	current_insn.field_value[i].align_order = 0;
      else
	current_insn.field_value[i].align_order
	  = mapped_operand[i].align;
    }

  current_insn.next_slot = opc->nr_fields;

  return finish_insn(opc);
}

static const char *
finish_lda(const struct avr32_syntax *syntax ATTRIBUTE_UNUSED)
{
  expressionS *exp = &current_insn.immediate;
  relax_substateT initial_subtype;
  symbolS *sym;
  offsetT off;
  int initial_size, max_size;
  char *buf;

  initial_size = LDA_INITIAL_SIZE;

  if (avr32_pic)
    {
      initial_subtype = LDA_SUBTYPE_SUB;
      if (linkrelax)
	max_size = 8;
      else
	max_size = 4;
    }
  else
    {
      initial_subtype = LDA_SUBTYPE_MOV1;
      max_size = 4;
    }

