fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  frag_grow(max_size);
  buf = frag_more(initial_size);
  dwarf2_emit_insn(initial_size);

  if (exp->X_op == O_symbol)
    {
      sym = exp->X_add_symbol;
      off = exp->X_add_number;
    }
  else
    {
      sym = make_expr_symbol(exp);
      off = 0;
    }

  frag_now->tc_frag_data.reloc_info = current_insn.field_value[0].value;
  frag_now->tc_frag_data.relaxer = &avr32_lda_relaxer;

  if (!avr32_pic)
    {
      /* The relaxer will bump the refcount if necessary */
      frag_now->tc_frag_data.pool
	= add_to_cpool(exp, &frag_now->tc_frag_data.pool_entry, 0);
    }

  frag_var(rs_machine_dependent, max_size - initial_size,
	   initial_size, initial_subtype, sym, off, buf);

  return NULL;
}

static const char *
finish_call(const struct avr32_syntax *syntax ATTRIBUTE_UNUSED)
{
  expressionS *exp = &current_insn.immediate;
  symbolS *sym;
  offsetT off;
  int initial_size, max_size;
  char *buf;

  initial_size = CALL_INITIAL_SIZE;

  if (avr32_pic)
    {
      if (linkrelax)
	max_size = 10;
      else
	max_size = 4;
    }
  else
    max_size = 4;

  frag_grow(max_size);
  buf = frag_more(initial_size);
  dwarf2_emit_insn(initial_size);

  frag_now->tc_frag_data.relaxer = &avr32_call_relaxer;

  if (exp->X_op == O_symbol)
    {
      sym = exp->X_add_symbol;
      off = exp->X_add_number;
    }
  else
    {
      sym = make_expr_symbol(exp);
      off = 0;
    }

  if (!avr32_pic)
    {
      /* The relaxer will bump the refcount if necessary */
      frag_now->tc_frag_data.pool
	= add_to_cpool(exp, &frag_now->tc_frag_data.pool_entry, 0);
    }

  frag_var(rs_machine_dependent, max_size - initial_size,
	   initial_size, CALL_SUBTYPE_RCALL1, sym, off, buf);

  return NULL;
}

void
md_begin (void)
{
  unsigned long flags = 0;
  int i;

  avr32_mnemonic_htab = hash_new();

  if (!avr32_mnemonic_htab)
    as_fatal(_("virtual memory exhausted"));

  for (i = 0; i < AVR32_NR_MNEMONICS; i++)
    {
      hash_insert(avr32_mnemonic_htab, avr32_mnemonic_table[i].name,
		  (void *)&avr32_mnemonic_table[i]);
    }

  if (linkrelax)
    flags |= EF_AVR32_LINKRELAX;
  if (avr32_pic)
    flags |= EF_AVR32_PIC;

  bfd_set_private_flags(stdoutput, flags);

#ifdef OPC_CONSISTENCY_CHECK
  if (sizeof(avr32_operand_table)/sizeof(avr32_operand_table[0])
      < AVR32_NR_OPERANDS)
    as_fatal(_("operand table is incomplete"));

  for (i = 0; i < AVR32_NR_OPERANDS; i++)
    if (avr32_operand_table[i].id != i)
      as_fatal(_("operand table inconsistency found at index %d\n"), i);
  pr_debug("%d operands verified\n", AVR32_NR_OPERANDS);

  for (i = 0; i < AVR32_NR_IFIELDS; i++)
    if (avr32_ifield_table[i].id != i)
      as_fatal(_("ifield table inconsistency found at index %d\n"), i);
  pr_debug("%d instruction fields verified\n", AVR32_NR_IFIELDS);

  for (i = 0; i < AVR32_NR_OPCODES; i++)
    {
      if (avr32_opc_table[i].id != i)
	as_fatal(_("opcode table inconsistency found at index %d\n"), i);
      if ((avr32_opc_table[i].var_field == -1
	   && avr32_relax_table[i].length != 0)
	  || (avr32_opc_table[i].var_field != -1
	      && avr32_relax_table[i].length == 0))
	as_fatal(_("relax table inconsistency found at index %d\n"), i);
    }
  pr_debug("%d opcodes verified\n", AVR32_NR_OPCODES);

  for (i = 0; i < AVR32_NR_SYNTAX; i++)
    if (avr32_syntax_table[i].id != i)
      as_fatal(_("syntax table inconsistency found at index %d\n"), i);
  pr_debug("%d syntax variants verified\n", AVR32_NR_SYNTAX);

  for (i = 0; i < AVR32_NR_ALIAS; i++)
    if (avr32_alias_table[i].id != i)
      as_fatal(_("alias table inconsistency found at index %d\n"), i);
  pr_debug("%d aliases verified\n", AVR32_NR_ALIAS);

  for (i = 0; i < AVR32_NR_MNEMONICS; i++)
    if (avr32_mnemonic_table[i].id != i)
      as_fatal(_("mnemonic table inconsistency found at index %d\n"), i);
  pr_debug("%d mnemonics verified\n", AVR32_NR_MNEMONICS);
#endif
}

void
md_assemble (char *str)
{
  struct avr32_mnemonic *mnemonic;
  char *p, c;

  memset(&current_insn, 0, sizeof(current_insn));
  current_insn.immediate.X_op = O_constant;

  skip_whitespace(str);
  for (p = str; *p; p++)
    if (*p == ' ')
      break;
  c = *p;
  *p = 0;

  mnemonic = hash_find(avr32_mnemonic_htab, str);
  *p = c;
  if (c) p++;

  if (mnemonic)
    {
      const struct avr32_syntax *syntax;

      for (syntax = mnemonic->syntax; syntax; syntax = syntax->next)
	{
	  const char *errmsg = NULL;

	  if (syntax_matches(syntax, p))
	    {
	      if (!(syntax->isa_flags & avr32_arch->isa_flags))
		{
		  as_bad(_("Selected architecture `%s'  does not support `%s'"),
			 avr32_arch->name, str);
		  return;
		}

	      current_insn.syntax = syntax;
	      parse_operands(p);

	      switch (syntax->type)
		{
		case AVR32_PARSER_NORMAL:
		  errmsg = finish_insn(syntax->u.opc);
		  break;
		case AVR32_PARSER_ALIAS:
		  errmsg = finish_alias(syntax->u.alias);
		  break;
		case AVR32_PARSER_LDA:
		  errmsg = finish_lda(syntax);
		  break;
		case AVR32_PARSER_CALL:
		  errmsg = finish_call(syntax);
		  break;
		default:
		  BAD_CASE(syntax->type);
		  break;
		}

	      if (errmsg)
		as_bad("%s in `%s'", errmsg, str);

	      return;
	    }
	}

      as_bad(_("unrecognized form of instruction: `%s'"), str);
    }
  else
    as_bad(_("unrecognized instruction `%s'"), str);
}

void avr32_cleanup(void)
{
  struct cpool *pool;

  /* Emit any constant pools that haven't been explicitly flushed with
     a .cpool directive. */
  for (pool = cpool_list; pool; pool = pool->next)
    {
      subseg_set(pool->section, pool->sub_section);
      s_cpool(0);
    }
}

/* Handle any PIC-related operands in data allocation pseudo-ops */
void
avr32_cons_fix_new (fragS *frag, int off, int size, expressionS *exp)
{
  bfd_reloc_code_real_type r_type = BFD_RELOC_UNUSED;
  int pcrel = 0;

  pr_debug("%s:%u: cons_fix_new, add_sym: %s, op_sym: %s, op: %d, add_num: %d\n",
	   frag->fr_file, frag->fr_line,
	   exp->X_add_symbol?S_GET_NAME(exp->X_add_symbol):"(none)",
	   exp->X_op_symbol?S_GET_NAME(exp->X_op_symbol):"(none)",
	   exp->X_op, exp->X_add_number);

  if (exp->X_op == O_subtract && exp->X_op_symbol)
    {
      if (exp->X_op_symbol == GOT_symbol)
	{
	  if (size != 4)
	    goto bad_size;
	  r_type = BFD_RELOC_AVR32_GOTPC;
	  exp->X_op = O_symbol;
	  exp->X_op_symbol = NULL;
	}
    }
  else if (exp->X_op == O_got)
    {
      switch (size)
	{
	case 1:
	  r_type = BFD_RELOC_AVR32_GOT8;
	  break;
	case 2:
	  r_type = BFD_RELOC_AVR32_GOT16;
	  break;
	case 4:
	  r_type = BFD_RELOC_AVR32_GOT32;
	  break;
	default:
	  goto bad_size;
	}

