fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
      exp->X_op = O_symbol;
    }

  if (r_type == BFD_RELOC_UNUSED)
    switch (size)
      {
      case 1:
	r_type = BFD_RELOC_8;
	break;
      case 2:
	r_type = BFD_RELOC_16;
	break;
      case 4:
	r_type = BFD_RELOC_32;
	break;
      default:
	goto bad_size;
      }
  else if (size != 4)
    {
    bad_size:
      as_bad(_("unsupported BFD relocation size %u"), size);
      r_type = BFD_RELOC_UNUSED;
    }

  fix_new_exp (frag, off, size, exp, pcrel, r_type);
}

static void
avr32_frob_section(bfd *abfd ATTRIBUTE_UNUSED, segT sec,
		   void *ignore ATTRIBUTE_UNUSED)
{
  segment_info_type *seginfo;
  fixS *fix;

  seginfo = seg_info(sec);
  if (!seginfo)
    return;

  for (fix = seginfo->fix_root; fix; fix = fix->fx_next)
    {
      if (fix->fx_done)
	continue;

      if (fix->fx_r_type == BFD_RELOC_AVR32_SUB5
	  && fix->fx_addsy && fix->fx_subsy)
	{
	  if (S_GET_SEGMENT(fix->fx_addsy) != S_GET_SEGMENT(fix->fx_subsy)
	      || linkrelax)
	    {
	      symbolS *tmp;
#ifdef DEBUG
	      fprintf(stderr, "Swapping symbols in fixup:\n");
	      print_fixup(fix);
#endif
	      tmp = fix->fx_addsy;
	      fix->fx_addsy = fix->fx_subsy;
	      fix->fx_subsy = tmp;
	      fix->fx_offset = -fix->fx_offset;
	    }
	}
    }
}

/* We need to look for SUB5 instructions with expressions that will be
   made PC-relative and switch fx_addsy with fx_subsy.  This has to be
   done before adjustment or the wrong symbol might be adjusted.

   This applies to fixups that are a result of expressions like -(sym
   - .) and that will make it all the way to md_apply_fix3().  LDA
   does the right thing in convert_frag, so we must not convert
   those. */
void
avr32_frob_file(void)
{
  /* if (1 || !linkrelax)
     return; */

  bfd_map_over_sections(stdoutput, avr32_frob_section, NULL);
}

static bfd_boolean
convert_to_diff_reloc(fixS *fixP)
{
  switch (fixP->fx_r_type)
    {
    case BFD_RELOC_32:
      fixP->fx_r_type = BFD_RELOC_AVR32_DIFF32;
      break;
    case BFD_RELOC_16:
      fixP->fx_r_type = BFD_RELOC_AVR32_DIFF16;
      break;
    case BFD_RELOC_8:
      fixP->fx_r_type = BFD_RELOC_AVR32_DIFF8;
      break;
    default:
      return FALSE;
    }

  return TRUE;
}

/* Simplify a fixup.  If possible, the fixup is reduced to a single
   constant which is written to the output file.  Otherwise, a
   relocation is generated so that the linker can take care of the
   rest.

   ELF relocations have certain constraints: They can only take a
   single symbol and a single addend.  This means that for difference
   expressions, we _must_ get rid of the fx_subsy symbol somehow.

   The difference between two labels in the same section can be
   calculated directly unless 'linkrelax' is set, or a relocation is
   forced.  If so, we must emit a R_AVR32_DIFFxx relocation.  If there
   are addends involved at this point, we must be especially careful
   as the relocation must point exactly to the symbol being
   subtracted.

   When subtracting a symbol defined in the same section as the fixup,
   we might be able to convert it to a PC-relative expression, unless
   linkrelax is set. If this is the case, there's no way we can make
   sure that the difference between the fixup and fx_subsy stays
   constant.  So for now, we're just going to disallow that.
   */
void
avr32_process_fixup(fixS *fixP, segT this_segment)
{
  segT add_symbol_segment = absolute_section;
  segT sub_symbol_segment = absolute_section;
  symbolS *fx_addsy, *fx_subsy;
  offsetT value = 0, fx_offset;
  bfd_boolean apply = FALSE;

  assert(this_segment != absolute_section);

  if (fixP->fx_r_type >= BFD_RELOC_UNUSED)
    {
      as_bad_where(fixP->fx_file, fixP->fx_line,
		   _("Bad relocation type %d\n"), fixP->fx_r_type);
      return;
    }

  /* BFD_RELOC_AVR32_SUB5 fixups have been swapped by avr32_frob_section() */
  fx_addsy = fixP->fx_addsy;
  fx_subsy = fixP->fx_subsy;
  fx_offset = fixP->fx_offset;

  if (fx_addsy)
    add_symbol_segment = S_GET_SEGMENT(fx_addsy);

  if (fx_subsy)
    {
      resolve_symbol_value(fx_subsy);
      sub_symbol_segment = S_GET_SEGMENT(fx_subsy);

      if (sub_symbol_segment == this_segment
	  && (!linkrelax
	      || S_GET_VALUE(fx_subsy) == (fixP->fx_frag->fr_address
					   + fixP->fx_where)))
	{
	  fixP->fx_pcrel = TRUE;
	  fx_offset += (fixP->fx_frag->fr_address + fixP->fx_where
			- S_GET_VALUE(fx_subsy));
	  fx_subsy = NULL;
	}
      else if (sub_symbol_segment == absolute_section)
	{
	  /* The symbol is really a constant.  */
	  fx_offset -= S_GET_VALUE(fx_subsy);
	  fx_subsy = NULL;
	}
      else if (SEG_NORMAL(add_symbol_segment)
	       && sub_symbol_segment == add_symbol_segment
	       && (!linkrelax || convert_to_diff_reloc(fixP)))
	{
	  /* Difference between two labels in the same section.  */
	  if (linkrelax)
	    {
	      /* convert_to_diff() has ensured that the reloc type is
		 either DIFF32, DIFF16 or DIFF8.  */
	      value = (S_GET_VALUE(fx_addsy) + fixP->fx_offset
		       - S_GET_VALUE(fx_subsy));

	      /* Try to convert it to a section symbol if possible  */
	      if (!S_FORCE_RELOC(fx_addsy, 1)
		  && !(sub_symbol_segment->flags & SEC_THREAD_LOCAL))
		{
		  fx_offset = S_GET_VALUE(fx_subsy);
		  fx_addsy = section_symbol(sub_symbol_segment);
		}
	      else
		{
		  fx_addsy = fx_subsy;
		  fx_offset = 0;
		}

	      fx_subsy = NULL;
	      apply = TRUE;
	    }
	  else
	    {
	      fx_offset += S_GET_VALUE(fx_addsy);
	      fx_offset -= S_GET_VALUE(fx_subsy);
	      fx_addsy = NULL;
	      fx_subsy = NULL;
	    }
	}
      else
	{
	  as_bad_where(fixP->fx_file, fixP->fx_line,
		       _("can't resolve `%s' {%s section} - `%s' {%s section}"),
		       fx_addsy ? S_GET_NAME (fx_addsy) : "0",
		       segment_name (add_symbol_segment),
		       S_GET_NAME (fx_subsy),
		       segment_name (sub_symbol_segment));
	  return;
	}
    }

  if (fx_addsy && !TC_FORCE_RELOCATION(fixP))
    {
      if (add_symbol_segment == this_segment
	  && fixP->fx_pcrel)
	{
	  value += S_GET_VALUE(fx_addsy);
	  value -= md_pcrel_from_section(fixP, this_segment);
	  fx_addsy = NULL;
	  fixP->fx_pcrel = FALSE;
	}
      else if (add_symbol_segment == absolute_section)
	{
	  fx_offset += S_GET_VALUE(fixP->fx_addsy);
	  fx_addsy = NULL;
	}
    }

