fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  if (!fx_addsy)
    fixP->fx_done = TRUE;

  if (fixP->fx_pcrel)
    {
      if (fx_addsy != NULL
	  && S_IS_DEFINED(fx_addsy)
	  && S_GET_SEGMENT(fx_addsy) != this_segment)
	value += md_pcrel_from_section(fixP, this_segment);

      switch (fixP->fx_r_type)
	{
	case BFD_RELOC_32:
	  fixP->fx_r_type = BFD_RELOC_32_PCREL;
	  break;
	case BFD_RELOC_16:
	  fixP->fx_r_type = BFD_RELOC_16_PCREL;
	  break;
	case BFD_RELOC_8:
	  fixP->fx_r_type = BFD_RELOC_8_PCREL;
	  break;
	case BFD_RELOC_AVR32_SUB5:
	  fixP->fx_r_type = BFD_RELOC_AVR32_16N_PCREL;
	  break;
	case BFD_RELOC_AVR32_16S:
	  fixP->fx_r_type = BFD_RELOC_AVR32_16B_PCREL;
	  break;
	case BFD_RELOC_AVR32_14UW:
	  fixP->fx_r_type = BFD_RELOC_AVR32_14UW_PCREL;
	  break;
	case BFD_RELOC_AVR32_10UW:
	  fixP->fx_r_type = BFD_RELOC_AVR32_10UW_PCREL;
	  break;
	default:
	  /* Should have been taken care of already */
	  break;
	}
    }

  if (fixP->fx_done || apply)
    {
      const struct avr32_ifield *ifield;
      char *buf = fixP->fx_where + fixP->fx_frag->fr_literal;

      if (fixP->fx_done)
	value += fx_offset;

      /* For hosts with longs bigger than 32-bits make sure that the top
         bits of a 32-bit negative value read in by the parser are set,
         so that the correct comparisons are made.  */
      if (value & 0x80000000)
        value |= (-1L << 31);

      switch (fixP->fx_r_type)
	{
	case BFD_RELOC_32:
	case BFD_RELOC_16:
	case BFD_RELOC_8:
	case BFD_RELOC_AVR32_DIFF32:
	case BFD_RELOC_AVR32_DIFF16:
	case BFD_RELOC_AVR32_DIFF8:
	  md_number_to_chars(buf, value, fixP->fx_size);
	  break;
	case BFD_RELOC_HI16:
	  value >>= 16;
	case BFD_RELOC_LO16:
	  value &= 0xffff;
	  md_number_to_chars(buf + 2, value, 2);
	  break;
	case BFD_RELOC_AVR32_16N_PCREL:
	  value = -value;
	  /* fall through */
	case BFD_RELOC_AVR32_22H_PCREL:
	case BFD_RELOC_AVR32_18W_PCREL:
	case BFD_RELOC_AVR32_16B_PCREL:
	case BFD_RELOC_AVR32_11H_PCREL:
	case BFD_RELOC_AVR32_9H_PCREL:
	case BFD_RELOC_AVR32_9UW_PCREL:
	case BFD_RELOC_AVR32_3U:
	case BFD_RELOC_AVR32_4UH:
	case BFD_RELOC_AVR32_6UW:
	case BFD_RELOC_AVR32_6S:
	case BFD_RELOC_AVR32_7UW:
	case BFD_RELOC_AVR32_8S_EXT:
	case BFD_RELOC_AVR32_8S:
	case BFD_RELOC_AVR32_10UW:
	case BFD_RELOC_AVR32_10SW:
	case BFD_RELOC_AVR32_STHH_W:
	case BFD_RELOC_AVR32_14UW:
	case BFD_RELOC_AVR32_16S:
	case BFD_RELOC_AVR32_16U:
	case BFD_RELOC_AVR32_21S:
	case BFD_RELOC_AVR32_SUB5:
	case BFD_RELOC_AVR32_CPCALL:
	case BFD_RELOC_AVR32_16_CP:
	case BFD_RELOC_AVR32_9W_CP:
	case BFD_RELOC_AVR32_15S:
	  ifield = fixP->tc_fix_data.ifield;
	  pr_debug("insert field: %ld <= %ld <= %ld (align %u)\n",
		   fixP->tc_fix_data.min, value, fixP->tc_fix_data.max,
		   fixP->tc_fix_data.align);
	  if (value < fixP->tc_fix_data.min || value > fixP->tc_fix_data.max)
	    as_bad_where(fixP->fx_file, fixP->fx_line,
			 _("operand out of range (%ld not between %ld and %ld)"),
			 value, fixP->tc_fix_data.min, fixP->tc_fix_data.max);
	  if (value & ((1 << fixP->tc_fix_data.align) - 1))
	    as_bad_where(fixP->fx_file, fixP->fx_line,
			 _("misaligned operand (required alignment: %d)"),
			 1 << fixP->tc_fix_data.align);
	  ifield->insert(ifield, buf, value >> fixP->tc_fix_data.align);
	  break;
	case BFD_RELOC_AVR32_ALIGN:
	  /* Nothing to do */
	  fixP->fx_done = FALSE;
	  break;
	default:
	  as_fatal("reloc type %s not handled\n",
		   bfd_get_reloc_code_name(fixP->fx_r_type));
	}
    }

  fixP->fx_addsy = fx_addsy;
  fixP->fx_subsy = fx_subsy;
  fixP->fx_offset = fx_offset;

  if (!fixP->fx_done)
    {
      if (!fixP->fx_addsy)
	fixP->fx_addsy = abs_section_sym;

      symbol_mark_used_in_reloc(fixP->fx_addsy);
      if (fixP->fx_subsy)
	abort();
    }
}

#if 0
void
md_apply_fix3 (fixS *fixP, valueT *valP, segT seg)
{
  const struct avr32_ifield *ifield;
  offsetT	value = *valP;
  char		*buf = fixP->fx_where + fixP->fx_frag->fr_literal;
  bfd_boolean	apply;

  pr_debug("%s:%u: apply_fix3: r_type=%d value=%lx offset=%lx\n",
	   fixP->fx_file, fixP->fx_line, fixP->fx_r_type, *valP,
	   fixP->fx_offset);

  if (fixP->fx_r_type >= BFD_RELOC_UNUSED)
    {
      as_bad_where(fixP->fx_file, fixP->fx_line,
		   _("Bad relocation type %d\n"), fixP->fx_r_type);
      return;
    }

  if (!fixP->fx_addsy && !fixP->fx_subsy)
    fixP->fx_done = 1;

  if (fixP->fx_pcrel)
    {
      if (fixP->fx_addsy != NULL
	  && S_IS_DEFINED(fixP->fx_addsy)
	  && S_GET_SEGMENT(fixP->fx_addsy) != seg)
	value += md_pcrel_from_section(fixP, seg);

      switch (fixP->fx_r_type)
	{
	case BFD_RELOC_32:
	  fixP->fx_r_type = BFD_RELOC_32_PCREL;
	  break;
	case BFD_RELOC_16:
	case BFD_RELOC_8:
	  as_bad_where (fixP->fx_file, fixP->fx_line,
			_("8- and 16-bit PC-relative relocations not supported"));
	  break;
	case BFD_RELOC_AVR32_SUB5:
	  fixP->fx_r_type = BFD_RELOC_AVR32_PCREL_SUB5;
	  break;
	case BFD_RELOC_AVR32_16S:
	  fixP->fx_r_type = BFD_RELOC_AVR32_16_PCREL;
	  break;
	default:
	  /* Should have been taken care of already */
	  break;
	}
    }

  if (fixP->fx_r_type == BFD_RELOC_32
      && fixP->fx_subsy)
    {
      fixP->fx_r_type = BFD_RELOC_AVR32_DIFF32;

      /* Offsets are only allowed if it's a result of adjusting a
	 local symbol into a section-relative offset.
	 tc_fix_adjustable() should prevent any adjustment if there
	 was an offset involved before.  */
      if (fixP->fx_offset && !symbol_section_p(fixP->fx_addsy))
	as_bad_where(fixP->fx_file, fixP->fx_line,
		     _("cannot represent symbol difference with an offset"));

      value = (S_GET_VALUE(fixP->fx_addsy) + fixP->fx_offset
	       - S_GET_VALUE(fixP->fx_subsy));

      /* The difference before any relaxing takes place is written
	 out, and the DIFF32 reloc identifies the address of the first
	 symbol (i.e. the on that's subtracted.)  */
      *valP = value;
      fixP->fx_offset -= value;
      fixP->fx_subsy = NULL;

      md_number_to_chars(buf, value, fixP->fx_size);
    }

  if (fixP->fx_done)
    {
      switch (fixP->fx_r_type)
	{
	case BFD_RELOC_8:
	case BFD_RELOC_16:
	case BFD_RELOC_32:
	  md_number_to_chars(buf, value, fixP->fx_size);
	  break;
	case BFD_RELOC_HI16:
	  value >>= 16;
	case BFD_RELOC_LO16:
	  value &= 0xffff;
	  *valP = value;
	  md_number_to_chars(buf + 2, value, 2);
	  break;
	case BFD_RELOC_AVR32_PCREL_SUB5:
	  value = -value;
	  /* fall through */
	case BFD_RELOC_AVR32_9_PCREL:
	case BFD_RELOC_AVR32_11_PCREL:
	case BFD_RELOC_AVR32_16_PCREL:
	case BFD_RELOC_AVR32_18_PCREL:
	case BFD_RELOC_AVR32_22_PCREL:
	case BFD_RELOC_AVR32_3U:
	case BFD_RELOC_AVR32_4UH:
	case BFD_RELOC_AVR32_6UW:
	case BFD_RELOC_AVR32_6S:
	case BFD_RELOC_AVR32_7UW:
	case BFD_RELOC_AVR32_8S:
	case BFD_RELOC_AVR32_10UW:
	case BFD_RELOC_AVR32_10SW:
	case BFD_RELOC_AVR32_14UW:
	case BFD_RELOC_AVR32_16S:
	case BFD_RELOC_AVR32_16U:
	case BFD_RELOC_AVR32_21S:
	case BFD_RELOC_AVR32_BRC1:
	case BFD_RELOC_AVR32_SUB5:
	case BFD_RELOC_AVR32_CPCALL:
	case BFD_RELOC_AVR32_16_CP:
	case BFD_RELOC_AVR32_9_CP:
	case BFD_RELOC_AVR32_15S:
	  ifield = fixP->tc_fix_data.ifield;
	  pr_debug("insert field: %ld <= %ld <= %ld (align %u)\n",
		   fixP->tc_fix_data.min, value, fixP->tc_fix_data.max,
		   fixP->tc_fix_data.align);
	  if (value < fixP->tc_fix_data.min || value > fixP->tc_fix_data.max)
	    as_bad_where(fixP->fx_file, fixP->fx_line,
			 _("operand out of range (%ld not between %ld and %ld)"),
			 value, fixP->tc_fix_data.min, fixP->tc_fix_data.max);
	  if (value & ((1 << fixP->tc_fix_data.align) - 1))
	    as_bad_where(fixP->fx_file, fixP->fx_line,
			 _("misaligned operand (required alignment: %d)"),
			 1 << fixP->tc_fix_data.align);
	  ifield->insert(ifield, buf, value >> fixP->tc_fix_data.align);
	  break;
	case BFD_RELOC_AVR32_ALIGN:
	  /* Nothing to do */
	  fixP->fx_done = FALSE;
	  break;
	default:
	  as_fatal("reloc type %s not handled\n",
		   bfd_get_reloc_code_name(fixP->fx_r_type));
	}
    }
}
#endif

arelent *
tc_gen_reloc (asection *section ATTRIBUTE_UNUSED,
	      fixS *fixp)
{
  arelent *reloc;
  bfd_reloc_code_real_type code;

  reloc = xmalloc (sizeof (arelent));

  reloc->sym_ptr_ptr = xmalloc (sizeof (asymbol *));
  *reloc->sym_ptr_ptr = symbol_get_bfdsym (fixp->fx_addsy);
  reloc->address = fixp->fx_frag->fr_address + fixp->fx_where;
  reloc->addend = fixp->fx_offset;
  code = fixp->fx_r_type;

  reloc->howto = bfd_reloc_type_lookup (stdoutput, code);

  if (reloc->howto == NULL)
    {
      as_bad_where (fixp->fx_file, fixp->fx_line,
		    _("cannot represent relocation %s in this object file format"),
		    bfd_get_reloc_code_name (code));
      return NULL;
    }

  return reloc;
}

bfd_boolean
avr32_force_reloc(fixS *fixP)
{
  if (linkrelax && fixP->fx_addsy
      && !(S_GET_SEGMENT(fixP->fx_addsy)->flags & SEC_DEBUGGING)
      && S_GET_SEGMENT(fixP->fx_addsy) != absolute_section)
    {
      pr_debug(stderr, "force reloc: addsy=%p, r_type=%d, sec=%s\n",
	       fixP->fx_addsy, fixP->fx_r_type, S_GET_SEGMENT(fixP->fx_addsy)->name);
      return 1;
    }

