fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  return generic_force_reloc(fixP);
}

bfd_boolean
avr32_fix_adjustable(fixS *fixP)
{
  switch (fixP->fx_r_type)
    {
      /* GOT relocations can't have addends since BFD treats all
	 references to a given symbol the same. This means that we
	 must avoid section-relative references to local symbols when
	 dealing with these kinds of relocs */
    case BFD_RELOC_AVR32_GOT32:
    case BFD_RELOC_AVR32_GOT16:
    case BFD_RELOC_AVR32_GOT8:
    case BFD_RELOC_AVR32_GOT21S:
    case BFD_RELOC_AVR32_GOT18SW:
    case BFD_RELOC_AVR32_GOT16S:
    case BFD_RELOC_AVR32_LDA_GOT:
    case BFD_RELOC_AVR32_GOTCALL:
      pr_debug("fix not adjustable\n");
      return 0;

    default:
      break;
    }

  return 1;
}

/* When we want the linker to be able to relax the code, we need to
   output a reloc for every .align directive requesting an alignment
   to a four byte boundary or larger.  If we don't do this, the linker
   can't guarantee that the alignment is actually maintained in the
   linker output.

   TODO: Might as well insert proper NOPs while we're at it... */
void
avr32_handle_align(fragS *frag)
{
  if (linkrelax
      && frag->fr_type == rs_align_code
      && frag->fr_address + frag->fr_fix > 0
      && frag->fr_offset > 0)
    {
      /* The alignment order (fr_offset) is stored in the addend. */
      fix_new(frag, frag->fr_fix, 2, &abs_symbol, frag->fr_offset,
	      FALSE, BFD_RELOC_AVR32_ALIGN);
    }
}

/* Relax_align. Advance location counter to next address that has 'alignment'
   lowest order bits all 0s, return size of adjustment made.  */
relax_addressT
avr32_relax_align(segT segment ATTRIBUTE_UNUSED,
		  fragS *fragP,
		  relax_addressT address)
{
  relax_addressT mask;
  relax_addressT new_address;
  int alignment;

  alignment = fragP->fr_offset;
  mask = ~((~0) << alignment);
  new_address = (address + mask) & (~mask);

  return new_address - address;
}

/* Turn a string in input_line_pointer into a floating point constant
   of type type, and store the appropriate bytes in *litP.  The number
   of LITTLENUMS emitted is stored in *sizeP .  An error message is
   returned, or NULL on OK. */

/* Equal to MAX_PRECISION in atof-ieee.c */
#define MAX_LITTLENUMS 6

char *
md_atof (type, litP, sizeP)
char   type;
char * litP;
int *  sizeP;
{
  int              i;
  int              prec;
  LITTLENUM_TYPE   words [MAX_LITTLENUMS];
  char *           t;

  switch (type)
  {
    case 'f':
    case 'F':
    case 's':
    case 'S':
      prec = 2;
      break;

    case 'd':
    case 'D':
    case 'r':
    case 'R':
      prec = 4;
      break;

      /* FIXME: Some targets allow other format chars for bigger sizes here.  */

    default:
      * sizeP = 0;
      return _("Bad call to md_atof()");
  }

  t = atof_ieee (input_line_pointer, type, words);
  if (t)
    input_line_pointer = t;
  * sizeP = prec * sizeof (LITTLENUM_TYPE);

  for (i = 0; i < prec; i++)
  {
    md_number_to_chars (litP, (valueT) words[i],
                        sizeof (LITTLENUM_TYPE));
    litP += sizeof (LITTLENUM_TYPE);
  }

  return 0;
}

static char *avr32_end_of_match(char *cont, char *what)
{
  int len = strlen (what);

  if (! is_part_of_name (cont[len])
      && strncasecmp (cont, what, len) == 0)
    return cont + len;

  return NULL;
}

int
avr32_parse_name (char const *name, expressionS *exp, char *nextchar)
{
  char *next = input_line_pointer;
  char *next_end;

  pr_debug("parse_name: %s, nextchar=%c (%02x)\n", name, *nextchar, *nextchar);

  if (*nextchar == '(')
    {
      if (strcasecmp(name, "hi") == 0)
	{
	  *next = *nextchar;

	  expression(exp);

	  if (exp->X_op == O_constant)
	    {
	      pr_debug("  -> constant hi(0x%08lx) -> 0x%04lx\n",
		       exp->X_add_number, exp->X_add_number >> 16);
	      exp->X_add_number = (exp->X_add_number >> 16) & 0xffff;
	    }
	  else
	    {
	      exp->X_md = exp->X_op;
	      exp->X_op = O_hi;
	    }

	  return 1;
	}
      else if (strcasecmp(name, "lo") == 0)
	{
	  *next = *nextchar;

	  expression(exp);

	  if (exp->X_op == O_constant)
	    exp->X_add_number &= 0xffff;
	  else
	    {
	      exp->X_md = exp->X_op;
	      exp->X_op = O_lo;
	    }

	  return 1;
	}
    }
  else if (*nextchar == '@')
    {
      exp->X_md = exp->X_op;

      if ((next_end = avr32_end_of_match (next + 1, "got")))
	exp->X_op = O_got;
      else if ((next_end = avr32_end_of_match (next + 1, "tlsgd")))
	exp->X_op = O_tlsgd;
      /* Add more as needed */
      else
	{
	  char c;
	  input_line_pointer++;
	  c = get_symbol_end();
	  as_bad (_("unknown relocation override `%s'"), next + 1);
	  *input_line_pointer = c;
	  input_line_pointer = next;
	  return 0;
	}

      exp->X_op_symbol = NULL;
      exp->X_add_symbol = symbol_find_or_make (name);
      exp->X_add_number = 0;

      *input_line_pointer = *nextchar;
      input_line_pointer = next_end;
      *nextchar = *input_line_pointer;
      *input_line_pointer = '\0';
      return 1;
    }
  else if (strcmp (name, "_GLOBAL_OFFSET_TABLE_") == 0)
    {
      if (!GOT_symbol)
	GOT_symbol = symbol_find_or_make(name);

      exp->X_add_symbol = GOT_symbol;
      exp->X_op = O_symbol;
      exp->X_add_number = 0;
      return 1;
    }

  return 0;
}

static void
s_rseg (int value ATTRIBUTE_UNUSED)
{
  /* Syntax: RSEG segment_name [:type] [NOROOT|ROOT] [(align)]
   * Defaults:
   *  - type: undocumented ("typically CODE or DATA")
   *  - ROOT
   *  - align: 1 for code, 0 for others
   *
   * TODO: NOROOT is ignored. If gas supports discardable segments, it should
   * be implemented.
   */
  char *name, *end;
  int length, type, attr;
  int align = 0;

  SKIP_WHITESPACE();

  end = input_line_pointer;
  while (0 == strchr ("\n\t;:( ", *end))
    end++;
  if (end == input_line_pointer)
    {
      as_warn (_("missing name"));
      ignore_rest_of_line();
      return;
    }

  name = xmalloc (end - input_line_pointer + 1);
  memcpy (name, input_line_pointer, end - input_line_pointer);
  name[end - input_line_pointer] = '\0';
  input_line_pointer = end;

  SKIP_WHITESPACE();

  type = SHT_NULL;
  attr = 0;

