fedya/aircam-openwrt/build_dir/toolchain-arm_v5te_gcc-linaro_uClibc-0.9.32_eabi/binutils-2.20.1/gas/config/tc-avr32.c
  if (*input_line_pointer == ':')
    {
      /* Skip the colon */
      ++input_line_pointer;
      SKIP_WHITESPACE();

      /* Possible options at this point:
       *   - flag (ROOT or NOROOT)
       *   - a segment type
       */
      end = input_line_pointer;
      while (0 == strchr ("\n\t;:( ", *end))
	end++;
      length = end - input_line_pointer;
      if (((length == 4) && (0 == strncasecmp( input_line_pointer, "ROOT", 4))) ||
	  ((length == 6) && (0 == strncasecmp( input_line_pointer, "NOROOT", 6))))
	{
	  /* Ignore ROOT/NOROOT */
	  input_line_pointer = end;
	}
      else
	{
	  /* Must be a segment type */
	  switch (*input_line_pointer)
	    {
	    case 'C':
	    case 'c':
	      if ((length == 4) &&
		  (0 == strncasecmp (input_line_pointer, "CODE", 4)))
		{
		  attr |= SHF_ALLOC | SHF_EXECINSTR;
		  type = SHT_PROGBITS;
		  align = 1;
		  break;
		}
	      if ((length == 5) &&
		  (0 == strncasecmp (input_line_pointer, "CONST", 5)))
		{
		  attr |= SHF_ALLOC;
		  type = SHT_PROGBITS;
		  break;
		}
	      goto de_fault;

	    case 'D':
	    case 'd':
	      if ((length == 4) &&
		  (0 == strncasecmp (input_line_pointer, "DATA", 4)))
		{
		  attr |= SHF_ALLOC | SHF_WRITE;
		  type = SHT_PROGBITS;
		  break;
		}
	      goto de_fault;

	      /* TODO: Add FAR*, HUGE*, IDATA and NEAR* if necessary */

	    case 'U':
	    case 'u':
	      if ((length == 7) &&
		  (0 == strncasecmp (input_line_pointer, "UNTYPED", 7)))
		break;
	      goto de_fault;

	      /* TODO: Add XDATA and ZPAGE if necessary */

	    de_fault:
	    default:
	      as_warn (_("unrecognized segment type"));
	    }

	  input_line_pointer = end;
	  SKIP_WHITESPACE();

	  if (*input_line_pointer == ':')
	    {
	      /*  ROOT/NOROOT */
	      ++input_line_pointer;
	      SKIP_WHITESPACE();

	      end = input_line_pointer;
	      while (0 == strchr ("\n\t;:( ", *end))
		end++;
	      length = end - input_line_pointer;
	      if (! ((length == 4) &&
		     (0 == strncasecmp( input_line_pointer, "ROOT", 4))) &&
		  ! ((length == 6) &&
		     (0 == strncasecmp( input_line_pointer, "NOROOT", 6))))
		{
		  as_warn (_("unrecognized segment flag"));
		}

	      input_line_pointer = end;
	      SKIP_WHITESPACE();
	    }
	}
    }

  if (*input_line_pointer == '(')
    {
      align = get_absolute_expression ();
    }

  demand_empty_rest_of_line();

  obj_elf_change_section (name, type, attr, 0, NULL, 0, 0);
#ifdef AVR32_DEBUG
  fprintf( stderr, "RSEG: Changed section to %s, type: 0x%x, attr: 0x%x\n",
      name, type, attr );
  fprintf( stderr, "RSEG: Aligning to 2**%d\n", align );
#endif

  if (align > 15)
    {
      align = 15;
      as_warn (_("alignment too large: %u assumed"), align);
    }

  /* Hope not, that is */
  assert (now_seg != absolute_section);

  /* Only make a frag if we HAVE to... */
  if (align != 0 && !need_pass_2)
    {
      if (subseg_text_p (now_seg))
	frag_align_code (align, 0);
      else
	frag_align (align, 0, 0);
    }

  record_alignment (now_seg, align - OCTETS_PER_BYTE_POWER);
}

/* vim: syntax=c sw=2
 */
